Repository: nelc/futurex-translations
Catalog: translation-overrides/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: {studio_name} works like web applications you already know, yet understands how you build curriculum. Instant publishing to the web when you want it, incremental release when it makes sense. And with co-authors, you can have a whole team building a course, together.
ar: يعمل استوديو {studio_name} كتطبيقات الويب المألوفة لديك، إلّا أنّه يفهم كيفية بنائك للمنهج. يمكنك أن تنشره فورًا متى تريد، وأن تزيد محتواه تصاعديًّا متى ترى ذلك مناسبًا. ومع المؤلّفين المشاركين، قد يصبح لديك فريق متكامل يبني مقررًا، معًا.

source: When you've finished a {strong_start}section{strong_end}, pick when you want it to go live and {studio_name} takes care of the rest. Build your course incrementally.
ar: عند الانتهاء من {strong_start}section{strong_end}، اختر عندما تود إجراء بث حي و{studio_name} يعتني بالبقية. ابن دورتك التدريبية تدريجيًا.

source: Co-authors have full access to all the same authoring tools. Make your course better through a team effort.
ar: يتمتّع المؤلّفون المشاركون بإمكانية استخدام كافة أدوات التأليف ذاتها. ويمكنك إذًا أن تحسّن جودة مساقك من خلال جهد جماعي.

source: Sign Up & Start Making Your {platform_name} Course
ar: الاشتراك وبدء إنشاء دورتك التدريبية {platform_name}

source: Outlining Your Course
ar: وضع المخطّط الكلّي لمساقك

source: Simple two-level outline to organize your course. Drag and drop, and see your course at a glance.
ar: مخطط بسيط من مستويين لتنظيم دورتك التدريبية. اسحب وأسقط، وشاهد دورتك التدريبية في لمحة.

source: Course Import
ar: استيراد المقرر

source: Be sure you want to import a course before continuing. The contents of the imported course will replace the contents of the existing course. {em_start}You cannot undo a course import{em_end}. Before you proceed, we recommend that you export the current course, so that you have a backup copy of it.
ar: يُرجى التأكّد من رغبتك في استيراد المقرر قبل المتابعة. فإنّ محتويات المقرر المستورد ستحلّ محلّ محتويات المقرر القائم. {em_start}وانتبه إلى أنّه لا يمكنك التراجع عن عملية استيراد المقرر{em_end}. لذا قبل أن تُتابع، نوصيك بتصدير المقرر الحالي أوّلًا ليكون لديك نسخة احتياطية منه.

source: The course that you import must be in a .tar.gz file (that is, a .tar file compressed with GNU Zip). This .tar.gz file must contain a course.xml file. It may also contain other files.
ar: يجب على المقرر الذي تستورده أن يكون موجودًا في ملف يحمل امتداد .tar.gz (أي ملف .tar مضغوط ببرنامج GNU Zip). وينبغي أن يتضمّن ملف .tar.gz ملفًّا ذي امتداد course.xml، بالإضافة إلى ملفّات أخرى.

source: The import process has five stages. During the first two stages, you must stay on this page. You can leave this page after the Unpacking stage has completed. We recommend, however, that you don't make important changes to your course until the import operation has completed.
ar: تمرّ عملية الاستيراد بخمس مراحل. وعليك أن تبقى على هذه الصفحة في أوّل مرحلتين. ثمّ يمكنك مغادرة هذه الصفحة بعد أن تُستكمل مرحلة التفريغ. ولكنّنا نوصيك بعدم إجراء تغييرات أساسية في مساقك قبل أن تُستكمل عملية الاستيراد.

source: Select a .tar.gz File to Replace Your Course Content
ar: اختر ملفّ .tar.gz لاستبدال محتوى مساقك

source: Replace my course with the selected file
ar: استبدل مساقي بالملف المختار

source: Course Import Status
ar: حالة استيراد المقرر

source: Updating Course
ar: جاري تحديث المقرر

source: Integrating your imported content into this course. This process might take longer with larger courses.
ar: جاري دمج محتواك المستورد في هذا المقرر. وقد تستغرق هذه العملية وقتًا أطول في حال كانت المقررات كبيرة.

source: Your imported content has now been integrated into this course
ar: جرى الآن دمج محتواك المستورد في هذا المقرر.

source: Note: Library content is not automatically updated in courses
ar: ملاحظة: لا يجري تحديث محتوى المكتبة تلقائيًا في المقررات.

source: If you change and import a library that is referenced by randomized content blocks in one or more courses, those courses do not automatically use the updated content. You must manually refresh the randomized content blocks to bring them up to date with the latest library content.
ar: إذا غيّرت واستوردتَ مكتبةً مشارًا إليها في كتل عشوائية من المحتويات في مساقٍ واحد أو أكثر، فإنّ هذه المقررات لا تستخدم المحتوى المحدَّث بشكل تلقائي، ويتوجّب عليك رجاءً تحديث الكتل العشوائية من المحتويات يدويًّا لجعلها مواكبة لأحدث محتوى في المكتبة.

source: Why import a course?
ar: ما هو الهدف من استيراد مقرر ما؟

source: You may want to run a new version of an existing course, or replace an existing course altogether. Or, you may have developed a course outside {studio_name}.
ar: قد ترغب في تشغيل نسخة جديدة من مقرر قائم، أو استبدال مقرر قائم بالكامل، أو ربّما تكون قد طوّرت مقررًا خارج {studio_name}.

source: Warning: Importing while a course is running
ar: تحذير: جاري الاستيراد أثناء تشغيل المقرر

source: If you perform an import while your course is running, and you change the URL names (or url_name nodes) of any Problem components, the student data associated with those Problem components may be lost. This data includes students' problem scores.
ar: في حال كنت تجري عملية استيراد أثناء تشغيل مساقك وأقدمت على تغيير أسماء الرابط (أو العقد url_name) لأي مكوِّنات خاصة بالمسائل، فإنّ بيانات الطالب المرتبطة بهذه المكوِّنات قد يجري فقدانها، ومن بينها درجات مسائل الطلّاب.

source: Learn more about importing a course
ar: اعرف المزيد عن استيراد مقرر

source: New Course
ar: مقرر جديد

source: Email staff to create course
ar: مراسلة فريق العمل عبر البريد الإلكتروني لإنشاء مقرر

source: Create a New Course
ar: إنشاء مقرر جديد

source: Required Information to Create a New Course
ar: المعلومات المطلوبة لإنشاء مقرر جديد

source: The public display name for your course. This cannot be changed, but you can set a different display name in Advanced Settings later.
ar: اسم العرض العام لمساقك. لا يمكن تغيير هذا الاسم ولكن يمكنك لاحقًا تحديد اسم عرض مختلف من خلال ’الإعدادات المتقدّمة‘.

source: The name of the organization sponsoring the course. {strong_start}Note: The organization name is part of the course URL.{strong_end} This cannot be changed, but you can set a different display name in Advanced Settings later.
ar: اسم المؤسسة الراعية للمقرر. {strong_start}ملاحظة: اسم المؤسسة هو جزء من رابط المقرر.{strong_end} لا يمكن تغيير هذا إلا أنه يمكنك تعيين اسم عرض مختلف، في وقتٍ لاحق، من خلال قسم الإعدادات المتقدّمة.

source: The unique number that identifies your course within your organization. {strong_start}Note: This is part of your course URL, so no spaces or special characters are allowed and it cannot be changed.{strong_end}
ar: يُعرّف الرقم الفريد مساقك ضمن منظمتك. {strong_start} ملاحظة: هذا جزء من رابط مساقك، لذا لا يُسمح باستخدام فراغات أو محارف خاصةـ كما ولا يمكن تغييره.{strong_end}

source: The term in which your course will run. {strong_start}Note: This is part of your course URL, so no spaces or special characters are allowed and it cannot be changed.{strong_end}
ar: يُعرّف الرقم الفريد مساقك ضمن منظمتك. {strong_start} ملاحظة: هذا جزء من رابط مساقك، لذا لا يُسمح باستخدام فراغات أو محارف خاصةـ كما ولا يمكن تغييره.{strong_end}

source: Show all courses in organization:
ar: عرض جميع المقررات في المؤسسة:

source: Courses Being Processed
ar: المقررات الجاري معالجتها

source: This course run is currently being created.
ar: يجري حاليًّا إنشاء تشغيل هذا المقرر.

source: The new course will be added to your course list in 5-10 minutes. Return to this page or {link_start}refresh it{link_end} to update the course list. The new course will need some manual configuration.
ar: سيُضاف المقرر الجديد إلى لائحة مساقاتك في غضون 5-10 دقائق. يُرجى العودة إلى هذه الصفحة أو {link_start}إعادة فتحها{link_end} لتحديث لائحة المساقات. وسيتطلّب المقرر الجديد ضبط بعض الإعدادات يدويًّا.

source: A system error occurred while your course was being processed. Please go to the original course to try the re-run again, or contact your PM for assistance.
ar: نأسف لحدوث خطأ في النظام أثناء معالجة مساقك. يُرجى الذهاب إلى المقرر الأساسي لإعادة تجريب التشغيل الثاني، أو الاتصال بمدير مشروعك للحصول على المساعدة.

source: Archived Courses
ar: المقررات المؤرشفة

source: Are you staff on an existing {studio_name} course?
ar: هل تنتمي إلى طاقم مقرر قائم في {studio_name}؟

source: The course creator must give you access to the course. Contact the course creator or administrator for the course you are helping to author.
ar: يجب أن يضيفك منشئ المقرر إلى المقرر. لذا يُرجى التواصل معه أو مع مشرِف المقرر الذي تساعد على تأليفه.

source: Create Your First Course
ar: إنشاء مساقك الأوّل

source: Your new course is just a click away!
ar: ستجد مساقك الجديد على بعد نقرة واحدة فقط!

source: Becoming a Course Creator in {studio_name}
ar: التحوّل إلى "منشئ مقرر" في {studio_name}

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team will evaluate your request and provide you feedback within 24 hours during the work week.
ar: يُعدّ {studio_name} حلًّا مستضافًا لشركائنا من xConsortium ولبعض الضيوف. وتظهر أعلاه المقررات التي أنت عضو فيها ويمكنك تعديلها، في حين أنّ صلاحيات منشئ المقرر تمنحها المنصّة {platform_name}. وسوف يقيِّم فريقنا طلبك ويزوّدك بالملاحظات والآراء في غضون 24 ساعة خلال أسبوع العمل.

source: Your Course Creator Request Status:
ar: حالة الطلب الذي تقدّمت به لتسجيلك كمُنشئ مقرر:

source: Request the Ability to Create Courses
ar: طلب صلاحية إنشاء المقررات

source: Your Course Creator Request Status
ar: حالة الطلب الذي تقدّمت به لتسجيلك كمُنشئ مقرر

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team is has completed evaluating your request.
ar: يُعدّ {studio_name} حلًّا مستضافًا لشركائنا من xConsortium ولبعض الضيوف. وتظهر أعلاه المقررات التي أنت عضو فيها ويمكنك تعديلها، في حين أنّ صلاحيات منشئ المقرر تمنحها المنصّة {platform_name}. يُرجى ملاحظة أنّ فريقنا قد استكمل تقييم طلبك.

source: Your Course Creator request is:
ar: إنّ الطلب الذي تقدّمت به لتسجيلك كمُنشئ مقرر:

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team is currently evaluating your request.
ar: يُعدّ {studio_name} حلًّا مستضافًا لشركائنا من xConsortium ولبعض الضيوف. وتظهر أعلاه المقررات التي أنت عضو فيها ويمكنك تعديلها، في حين أنّ صلاحيات منشئ المقرر تمنحها المنصّة {platform_name}. يُرجى ملاحظة أنّ فريقنا يقوم حاليًّا بتقييم طلبك.

source: Libraries hold a pool of components that can be re-used across multiple courses. Create your first library with the click of a button!
ar: تنطوي المكتبات على مجموعة من المكوِّنات التي يمكن إعادة استخدامها في عدّة مقررات. تفضَّل بإنشاء مكتبتك الأولى بمجرّد كبسة زرّ!

source: Can I create courses in {studio_name}?
ar: هل يمكنني أن أنشئ مقررات في {studio_name}؟

source: In order to create courses in {studio_name}, you must {link_start}contact {platform_name} staff to help you create a course{link_end}.
ar: لتتمكّن من إنشاء مقررات في {studio_name}، يُرجى منك {link_start}الاتّصال بطاقم منصّة {platform_name} لمساعدتك على إنشاء مقرر{link_end}.

source: In order to create courses in {studio_name}, you must have course creator privileges to create your own course.
ar: لتتمكّن من إنشاء مقررات في {studio_name}، يجب أن تتمتّع بصلاحيات منشئ المقرر لإنشاء مساقك الخاص بك.

source: Your request to author courses in {studio_name} has been denied. Please {link_start}contact {platform_name} Staff with further questions{link_end}.
ar: عذرًا، لقد رُفض طلبك بأن تنشئ مقررات في {studio_name}. يُرجى {link_start}الاتّصال بطاقم {platform_name} للمزيد من الاستفسار{link_end}.

source: Add components to your library for use in courses, using Add New Component at the bottom of this page.
ar: إضافة مكوِّنات إلى مكتبتك لاستخدامها في المقررات، وذلك من خلال "إضافة مكوِّن جديد" في أسفل هذه الصفحة.

source: Using library content in courses
ar: استخدام محتوى المكتبة في المقررات

source: Use library content in courses by adding the {em_start}library_content{em_end} policy key to the Advanced Module List in the course's Advanced Settings, then adding a Randomized Content Block to your courseware. In the settings for each Randomized Content Block, select this library as the source library, and specify the number of problems to be randomly selected and displayed to each student.
ar: يُرجى استخدام محتوى المكتبات في المقررات عبر إضافة مفتاح سياسة محتوى المكتبة {em_start}library_content{em_end} إلى ’قائمة الوحدات المتقدِّمة‘ في قسم ’الإعدادات المتقدِّمة‘ للمقرر، ثمّ إضافة خاصّية ’كتلة محتويات عشوائية‘ إلى محتويات مساقك. وفي الإعدادات الخاصة بكل كتلة محتويات عشوائية، يُرجى انتقاء هذه المكتبة باعتبارها المكتبة المصدر، ثمّ تحديد عدد المسائل التي سيجري انتقاؤها عشوائيًّا وعرضها على كل طالب.

source: Course Team Settings
ar: إعدادات فريق المقرر

source: Add a User to Your Course's Team
ar: إضافة مستخدم إلى فريق مساقك

source: Add Team Members to This Course
ar: إضافة أعضاء إلى فريق هذا المقرر

source: Adding team members makes course authoring collaborative. Users must be signed up for {studio_name} and have an active account.
ar: من شأن إضافة أعضاء إلى الفريق أن يجعل تأليف المقرر عملًا تعاونيًّا. ويجب أن يكون المستخدمون مسجّلي العضوية في {studio_name} ولديهم حسابًا نشطًا.

source: Course Team Roles
ar: أدوار فريق المقرر

source: Course team members with the Staff role are course co-authors. They have full writing and editing privileges on all course content.
ar: أعضاء فريق المقرر الذين يلعبون دور "الطاقم" هم مؤلّفون مشاركون للمقرر، ويملكون كامل امتيازات الكتابة والتعديل في كافة أقسام محتوى المقرر.

source: Admins are course team members who can add and remove other course team members.
ar: المشرفون هم من أعضاء فريق المقرر ويمكنهم إضافة أو إقصاء أعضاء آخرين من الفريق.

source: All course team members can access content in Studio, the LMS, and Insights, but are not automatically enrolled in the course.
ar: لدى جميع أعضاء فريق المقرر صلاحية رؤية المحتوى في "استوديو" ونظام إدارة التعلّم "LMS" وإنسايتس دون أن يجري تسجيلهم تلقائيًا في المقرر.

source: Every course must have an Admin. If you are the Admin and you want to transfer ownership of the course, click <strong>Add admin access</strong> to make another user the Admin, then ask that user to remove you from the Course Team list.
ar: يجب أن يكون لكل مقرر مشرف. وإذا كنت أنت هو المشرف وأردت نقل ملكية المقرر إلى الغير، يُرجى النقر على <strong>إضافة حقّ دخول مشرف</strong> لتوكّل مستخدمًا آخر بدور المشرف، ثمّ اطلب من هذا المستخدم أن يزيل اسمك من قائمة فريق المقرر.

source: Grant other members of your course team access to this library. New library users must have an active {studio_name} account.
ar: منح أعضاء آخرين من فريق مساقك إمكانية الدخول إلى هذه المكتبة. ويجب على المستخدمين الجدد للمكتبة أن يكون لديهم حساب نشط لدى {studio_name}.

source: Library Users can view library content and can reference or use library components in their courses, but they cannot edit the contents of a library.
ar: يمكن لمستخدمي المكتبات مشاهدة محتوى المكتبة والرجوع إلى مكوِّناتها أو استخدامها في مساقاتهم، لكن لا يمكنهم تعديل محتويات أي مكتبة.

source: The nuts and bolts of your course
ar: مكوِّنات العمل الأساسية لمساقك

source: Course Summary Page
ar: صفحة ملخّص المقرر

source: The course "{course_display_name}", provided by {platform_name}, is open for enrollment. Please navigate to this course at {link_for_about_page} to enroll.
ar: يُرجى ملاحظة أنّ مقرر "{course_display_name}"، الذي تقدّمه منصّة {platform_name}، مفتوح حاليًّا للتسجيل. ويمكنك الذهاب إليه عبر الرابط {link_for_about_page} للتسجيل.

source: Promoting Your Course with {platform_name}
ar: الترويج لمساقك من خلال منصّة {platform_name}

source: Your course summary page will not be viewable until your course has been announced. To provide content for the page and preview it, follow the instructions provided by your Program Manager.
ar: لن تكون صفحة ملخّص مساقك قابلة للمشاهدة حتى يُعلَن عن مساقك. ولتزوِّد الصفحة بالمحتوى وتعاينها، يُرجى اتّباع التعليمات التي يوفّرها مدير برنامجك.

source: Please note that changes here may take up to a business day to appear on your course summary page.
ar: يرجى ملاحظة أن التغييرات هنا قد تستغرق تقريبًا يوم عمل لتظهر على صفحة ملخص المقرر الخاصة بك.

source: Course Credit Requirements
ar: متطلّبات مواد المقرر

source: Steps required to earn course credit
ar: الخطوات اللازمة للنجاح في مواد المقرر

source: In-Course Reverification {number}
ar: عملية إعادة التحقّق داخل المقرر {number}

source: Course Pacing
ar: أسلوب التعلّم المتّبع في المقرر:

source: Set the pacing for this course
ar: اضبط أسلوب التعلّم المتّبع في هذا المقرر

source: Instructor-paced courses progress at the pace that the course author sets. You can configure release dates for course content and due dates for assignments.
ar: تسير المقررات غير الدائمة تبعًا لمخطط المقرر الكلي الذي يعدّه مدرس المقرر. يمكنك ضبط تواريخ نشر محتوى المقرر وتواريخ تسليم الواجبات.

source: Self-paced courses offer suggested due dates for assignments or exams based on the learner’s enrollment date and the expected course duration. These courses offer learners flexibility to modify the assignment dates as needed.
ar: تقدم مقررات التعلم الذاتي تواريخ مقترحة للمهام أو الاختبارات وفق تاريخ الالتحاق ومدة المقرر المقترحة. هذه المقررات توفر للمتعلّم خاصية المرونة في تحديد تواريخ المهام حسب الحاجة.

source: Course Schedule
ar: جدول المقرر

source: Dates that control when your course can be viewed
ar: التواريخ التي تحدّد متى يمكن الاطّلاع على مساقك

source: Course Start Date
ar: تاريخ بدء المقرر

source: First day the course begins
ar: اليوم الأوّل الذي يبدأ فيه المقرر

source: Course Start Time
ar: وقت بدء المقرر

source: Course End Date
ar: تاريخ انتهاء المقرر

source: Last day your course is active
ar: اليوم الأخير الذي يكون فيه المقرر مفعّلًا

source: Course End Time
ar: وقت انتهاء المقرر

source: Course Details
ar: تفاصيل المقرر

source: Provide useful information about your course
ar: يُرجى توفير معلومات مفيدة عن مساقك

source: Identify the course language here. This is used to assist users find courses that are taught in a specific language. It is also used to localize the 'From:' field in bulk emails.
ar: حدد لغة المقرر هنا. يساعد هذا المستخدمين للعثور على المقررات التي تدرّس بلغة معينة. كما أنها تستخدم لتوطين حقل "من:" في رسائل قوائم البريد الإلكتروني.

source: Introducing Your Course
ar: التعريف عن مساقك

source: Course Title
ar: عنوان الدورة

source: Displayed as title on the course details page. Limit to 50 characters.
ar: يظهر كعنوان على صفحة تفاصيل الدورة التدريبية. محدد على 50 رمزًا.

source: Course Subtitle
ar: عنوان الدورة الفرعي

source: Displayed as subtitle on the course details page. Limit to 150 characters.
ar: يظهر كعنوان فرعي على صفحة تفاصيل الدورة التدريبية. محدد على 150 رمزًا.

source: Course Duration
ar: مدة الدورة

source: Displayed on the course details page. Limit to 50 characters.
ar: يظهر على صفحة تفاصيل الدورة التدريبية. محدد على 50 رمزًا.

source: Course Description
ar: وصف الدورة

source: Displayed on the course details page. Limit to 1000 characters.
ar: يظهر على صفحة تفاصيل الدورة. مُحدد ل1000 حرف.

source: Course Short Description
ar: الوصف المختصر للمقرر

source: Appears on the course catalog page when students roll over the course name. Limit to ~150 characters
ar: يظهر على صفحة دليل المقرر عندما يجدّد الطلّاب اختيارهم لاسم المقرر. ويقتصر على حوالي 150 حرفًا.

source: Course Overview
ar: نظرة عامة عن المقرر

source: Introductions, prerequisites, FAQs that are used on {a_link_start}your course summary page{a_link_end} (formatted in HTML)
ar: المقدمات والمتطلبات الأساسية المسبقة والأسئلة الشائعة التي تستخدم في {a_link_start} صفحة ملخص دورتك التدريبية {a_link_end} (formatted in HTML)

source: Course About Sidebar HTML
ar: الشريط الجانبي عن المقرر HTML

source: Custom sidebar content for {a_link_start}your course summary page{a_link_end} (formatted in HTML)
ar: محتوى الشريط الجانبي المخصص لـ {a_link_start} صفحة ملخص المقرر {a_link_end} (بتنسيق HTML)

source: Course Card Image
ar: صورة بطاقة الدورة التدريبية

source: Your course currently does not have an image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 375px wide by 200px tall)
ar: ليس لمساقك صورة حاليًّا. يُرجى تحميل واحدة (بصيغة JPEG أو PNG، وبأبعاد يُقترح ألّا تقلّ عن 375 بكسل عرضًا و200 بكسل طولًا)

source: Your course image URL
ar: رابط صورة مساقك

source: Please provide a valid path and name to your course image (Note: only JPEG or PNG format supported)
ar: يُرجى تحديد مسار واسم صحيحين لصورة المقرر (ملاحظة: تُقبَل الصور بصيغة JPEG أو PNG فقط)

source: Upload Course Card Image
ar: تحميل صورة بطاقة الدورة التدريبية

source: Your course currently does not have an image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 1440px wide by 400px tall)
ar: لا تحتوي دورتك التدريبية على صورة في الوقت الحالي. الرجاء رفع صورة (تنسيق JPEG أو PNG، والحد الأدنى المقترح للأبعاد هو 1440 بيكسل بالنسبة للعرض في 400 بيكسل بالنسبة للطول)

source: Upload Course Banner Image
ar: رفع صورة شعار دورتك التدريبية

source: Your course currently does not have a video thumbnail image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 375px wide by 200px tall)
ar: لا تحتوي دورتك التدريبية على ‏‫صورة فيديو مصغرة في الوقت الحالي. الرجاء رفع صورة (تنسيق JPEG أو PNG، والحد الأدنى المقترح للأبعاد هو 375 بيكسل بالنسبة للعرض في 200 بيكسل بالنسبة للطول)

source: Course Introduction Video
ar: فيديو مقدّمة المقرر

source: Add the learning outcomes for this course
ar: إضافة نتائج تعلُّم لهذه الدورة التدريبية

source: Add details about the instructors for this course
ar: إضافة تفاصيل بشأن معلمي هذه الدورة التدريبية

source: Expectations of the students taking this course
ar: توقّعات الطلّاب الملتحقين بهذا المقرر

source: Time spent on all course work
ar: الوقت المبذول في كافة أعمال المقرر

source: Prerequisite Course
ar: مقرر أساسي

source: Course that students must complete before beginning this course
ar: المقرر الذي يجب أن يكملوه الطلّاب قبل البدء بهذا المقرر

source: set pre-requisite course
ar: تحديد المقرر الأساسي

source: Require students to pass an exam before beginning the course.
ar: يُطلَب من الطلّاب اجتياز اختبار معيّن قبل البدء بالمساق.

source: You can now view and author your course entrance exam from the {link_start}Course Outline{link_end}.
ar: يمكنك الآن رؤية امتحان الدخول الخاص بمساقك وتأليفه من خلال {link_start}مخطَّط المقرر{link_end}.

source: Course Content License
ar: ترخيص محتوى المقرر

source: Select the default license for course content
ar: يُرجى اختيار الترخيص الافتراضي لمحتوى المقرر

source: Your course's schedule determines when students can enroll in and begin a course.
ar: يحدّد جدول مساقك متى يمكن للطلّاب التسجيل في المقرر والبدء به.

source: Other information from this page appears on the About page for your course. This information includes the course overview, course image, introduction video, and estimated time requirements. Students use About pages to choose new courses to take.
ar: هناك معلومات أخرى في هذه الصفحة تَظهر على صفحة النبذة عن مساقك، وتتضمّن نظرة عامة عن المقرر، وصورة المقرر، ومقطع فيديو خاص بالمقدّمة، ومتطلّبات الوقت التقريبية. ويستخدم الطلّاب صفحات النبذة لاختيار المقررات الجديدة التي سيلتحقون بها.

source: Advanced settings control specific course functionality. On this page, you can edit manual policies, which are JSON-based key and value pairs that control specific course settings.
ar: تضبط الإعدادات المتقدّمة وظائف المقرر المحدّدة. ويمكنك في هذه الصفحة أن تعدّل السياسات اليدوية والتي هي أزواج من قيم ومفاتيح بتنسيق JSON وتتحكّم بإعدادت المقرر المحدّدة.

source: Settings for course credit eligibility
ar: إعدادات الأهلية لمواد المقرر
