Repository: nelc/futurex-translations
Catalog: translation-overrides/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: OPTIONAL: After this date/time, users will no longer be able to enroll in this mode. Leave this blank if users can enroll in this mode until enrollment closes for the course.
ar: اختياري: لن يتمكّن المستخدمون بعد هذا التاريخ/الوقت من التسجيل في هذا الوضع. يُرجى ترك هذا الحقل فارغًا في حال سيُسمح للمستخدمين التسجيل في هذا الوضع لحين إغلَاق باب التسجيل في المقرر.

source: OPTIONAL: This is the SKU (stock keeping unit) of this mode in the external ecommerce service. Leave this blank if the course has not yet been migrated to the ecommerce service.
ar: اختياري: هذه هي وحدة إدارة المخزون (SKU)الخاصّة بوضع خدمة التجارة الإلكترونية الخارجية هذا. يُرجى ترك هذا الحقل فارغًا إذا لم يكن المقرر قد أُتيح كأحد مساقات خدمة التجارة الإلكترونية.

source: The {course_mode} course mode has a minimum price of {min_price}. You must set a price greater than or equal to {min_price}.
ar: الحد الأدنى لسعر وضع المقرر{course_mode} {min_price}. يجب عليك تحديد سعر أكبر من أو يساوي {min_price}.

source: The time period before a course ends in which a course mode will expire
ar: الفترة الزمنية التي تسبق انتهاء المقرر والتي سينتهي بعدها وضع المقرر.

source: The course you are looking for does not start until {date}.
ar: عذرًا، المقرر الذي تبحث عنه لن يبدأ حتى {date}.

source: The course you are looking for is closed for enrollment as of {date}.
ar: المقرر الذي تبحث عنه مغلق لالالتحاق اعتبارا من {date}

source: Course id not specified
ar: الرقم التعريفي المقرر غير محدَّد

source: Invalid course id
ar: رقم تعريف المقرر غير صحيح

source: Course id is invalid
ar: رقم المقرر غير صحيح

source: You are not enrolled in this course
ar: عذرًا، أنت غير مسجَّل في هذا المقرر

source: Your certificate prevents you from unenrolling from this course
ar: تمنعك شهادتك من إلغاء تسجيلك في هذا المقرر

source: Course {course_id} requires {prerequisite_course_id}
ar: يستوجب المقرر {course_id} المتطلّب {prerequisite_course_id}

source: Only XBlocks listed in a course's Advanced Module List can be flagged as deprecated. Remember to update XBlockStudioConfiguration support state accordingly, as deprecated does not impact whether or not new XBlock instances can be created in Studio.
ar: فقط يمكن تحديد XBlocks المدرجة في قائمة Advanced Module للدورة التدريبية بعلامة تجاهل. تذكر تحديث حالة دعم XBlockStudioConfiguration وفقًا لذلك، لأن حالة "تجاهل" لا تؤثر على إمكانية إنشاء حالات XBlock جديدة في Studio من عدمها.

source: Enabled XBlock/template combinations with full or provisional support can always be created in Studio. Unsupported XBlock/template combinations require course author opt-in.
ar: يمكن دائمًا إنشاء تركيبات القالب/XBlock ممكنة مع دعم كامل أو مؤقت في Studio. تتطلب تركيبات القالب/XBlock موافقة مؤلف الدورة التدريبية.

source: You're almost there! Use the link below to activate your account to access engaging, high-quality %(platform_name)s courses. Note that you will not be able to log back into your account until you have activated it.
ar: أنت على وشك الانتهاء! استخدم الرابط أدناه لتنشيط حسابك للوصول إلى مقررات %(platform_name)s التعليمية عالية الجودة. الرجاء الملاحظة أن لا يمكن تسجيل الدخول مرة أخرى إلى حسابك حتى تقوم بتنشيطه.

source: Proctored exams are timed exams that you take while proctoring software monitors your computer's desktop, webcam video, and audio. Your course uses %(proctoring_provider)s software for proctoring.
ar: الامتحانات التي يتم مراقبتها هي اختبارات محددة بوقت يتم إجراؤها أثناء قيام برنامج المراقبة بمراقبة سطح المكتب لجهاز الكمبيوتر الخاص بك وفيديو كاميرا الويب والصوت. تستخدم مقررك الدراسي برنامج%(proctoring_provider)s للمراقبة

source: Completed the course "{course_name}" ({course_mode}, {start_date} - {end_date})
ar: استُكمِل المقرر "{course_name}" ({course_mode}, {start_date} - {end_date})

source: Completed the course "{course_name}" ({course_mode})
ar: لقد أتممت المقرر "{course_name}" ({course_mode})

source: The course mode for this badge image. For example, "verified" or "honor".
ar: وضع المقرر الموفق لصورة الشارة هذه. مثلًا، "موثَّقة" أو "شهادة ميثاق الشرف"

source: Set this value to True if you want this image to be the default image for any course modes that do not have a specified badge image. You can have only one default image.
ar: اضبط هذه القيمة على "صحيح" إذا أردت اعتماد هذه الصورة كصورة افتراضية لجميع أوضاع المقرر غير الموسومة بصورة محدَّدة. يمكن أن يكون لديك صورة افتراضية واحدة.

source: On each line, put the number of completed courses to award a badge for, a comma, and the slug of a badge class you have created that has the issuing component 'openedx__course'. For example: 3,enrolled_3_courses
ar: في كل سطر، ضع عنوانًا مختصرًا للجائزة على عدد المقررات المكتملة مع فاصلة وعنوانًا مختصرًا للفئة التي قمت بإنشائها وتحتوي على عنصر الإصدار "openedx__course". على سبيل المثال: 3,enrolled_3_courses

source: On each line, put the number of enrolled courses to award a badge for, a comma, and the slug of a badge class you have created that has the issuing component 'openedx__course'. For example: 3,enrolled_3_courses
ar: في كل سطر، ضع عنوانًا مختصرًا لجائزة على عدد الدورات المسجلة مع فاصلة وعنوانًا مختصرًا للفئة التي قمت بإنشائها وتحتوي على عنصر الإصدار "openedx__course". على سبيل المثال: 3,enrolled_3_courses

source: Each line is a comma-separated list. The first item in each line is the slug of a badge class you have created that has an issuing component of 'openedx__course'. The remaining items in each line are the course keys the learner needs to complete to be awarded the badge. For example: slug_for_compsci_courses_group_badge,course-v1:CompSci+Course+First,course-v1:CompsSci+Course+Second
ar: كل سطر عبارة عن قائمة مفصولة بفواصل. العنصر الأول في كل سطر هو العنوان المختصر للفئة التي قمت بإنشائها وتحتوي على عنصر إصدار "openedx__course". العناصر المتبقية في كل سطر تعد مفاتيح المقرر التي يحتاج المتعلم لإكمالها للحصول على الشارة. على سبيل المثال: slug_for_compsci_courses_group_badge,course-v1:CompSci+Course+First,course-v1:CompsSci+Course+Second

source: Take free online courses at edX.org
ar: الحصول على دورات مجانية في edX.org

source: "{course_title}" Course Staff
ar: فريق المقرر "{course_title}"

source: A CCX can only be created on this course through an external service. Contact a course admin to give you access.
ar: يمكن إنشاء "CCX" لهذا المقرر فقط من خلال خدمة خارجية. يُرجى الاتصال بمدير المقرر ليمنحك صلاحية الوصول.

source: The course is full: the limit is {max_student_enrollments_allowed}
ar: هذا المقرر مُمتلئ: الحد المسموح به هو {max_student_enrollments_allowed}

source: You cannot create a CCX from a course using a deprecated id. Please create a rerun of this course in the studio to allow this action.
ar: عذرًا، لا يمكنك إنشاء CCX من أحد المساقات باستخدام رقم تعريفي غير مقبول. ويُرجى المباشرة بعملية إعادة طرح هذا المقرر لإتاحة هذا الإجراء.

source: The course mode for this template.
ar: أسلوب المقرر المعتمد لهذا النموذج.

source: Course id '{course_id}' is not valid
ar: مفتاح المقرر '{course_id}' غير صحيح

source: The course does not exist against the given key '{course_key}'
ar: لا يتوفر مقرر للرقم التعريفي '{course_key}' المُعطى.

source: {course_key} is not a valid course key
ar: مفتاح المقرر {course_key} غير صالح

source: The course {course_key} does not exist
ar: المقرر {course_key} غير موجود

source: User {username} is not enrolled in the course {course_key}
ar: إن المستخدم {username} غير مسجّل في المقرر {course_key}

source: An {cert_type} certificate signifies that a learner has agreed to abide by the honor code established by {platform_name} and has completed all of the required tasks for this course under its guidelines.
ar: تُفيد شهادة {cert_type} معنى أنّ المتعلِّم قد وافق على الالتزام بميثاق الشرف المتعمَد لدى {platform_name} واستكمَل كافة المهام المطلوبة في هذا المقرر بموجب التعليمات.

source: {platform_name} acknowledges achievements through certificates, which are awarded for course activities that {platform_name} students complete.
ar: تُقرّ المنصّة {platform_name} الإنجازات من خلال شهادات، تُمنح مقابل أنشطة المقرر التي يُكملها طلّاب {platform_name}

source: a course of study offered by {partner_short_name}, an online learning initiative of {partner_long_name}.
ar: مقرر دروس تعليمية يقدِّمه {partner_short_name}، وهو عبارة عن مبادرة تعليمية من {partner_long_name}.

source: a course of study offered by {partner_short_name}.
ar: مقرر دروس تعليمية يقدِّمه {partner_short_name}.

source: I completed the {course_title} course on {platform_name}.
ar: لقد أتممت مقرر {course_title} على {platform_name}.

source: I completed a course at {platform_name}. Take a look at my certificate.
ar: لقد أكملت مقررًا على {platform_name}. شاهد شهادتي.

source: {course_id} is not a valid course key.
ar: مفتاح المقرر {course_id} غير صحيح

source: Course {course_id} does not exist.
ar: المقرر {course_id} غير موجود

source: Path to course(s) checkout page hosted by the E-Commerce service.
ar: التوجه إلى صفحة الدفع الخاصة بالمساق(ات) المستضافة من قبل خدمة التجارة الإلكترونية.

source: Unsubscribe from goal reminder emails for this course
ar: إلغاء الاشتراك من رسائل البريد الإلكتروني الخاصة بتذكيرالاهدف لهذه الدورة

source: If any of these values is left empty or "Unknown", then their value at runtime will be retrieved from the next most specific context that applies. For example, if "Disabled" is left as "Unknown" in the course context, then that course will be Disabled only if the org that it is in is Disabled.
ar: إذا تُركت أي من هذه القيم فارغة أو "غير معروفة"، فسيتم استرداد قيمتها في وقت التشغيل من السياق التالي الأكثر تحديدًا الذي ينطبق. على سبيل المثال ، إذا تم ترك "معطل" على أنه "غير معروف" في سياق الدورة، فلن يتم تعطيل هذا المقرر إلا إذا كانت المؤسسة الموجود بها معطلة.

source: Course is full
ar: المقرر كامل الآن

source: Your course goal has been successfully set.
ar: تم ضبط هدف مساقك بنجاح

source: Course goal updated successfully.
ar: تم تحديث هدف المقرر بنجاح

source: Course page automatically created.
ar: جرى إنشاء صفحة المقرر تلقائيًّا.

source: Visit a course wiki to add an article.
ar: قم بزيارة ويكي أحد المساقات لإضافة مقال.

source: Course has not started
ar: لم يبدأ المقرر بعد

source: Course does not start until {}
ar: لن يبدأ المقرر حتى {}

source: You do not have access to this course
ar: عذرًا، لا تملك صلاحية دخول هذا المقرر

source: You do not have access to this course on a mobile device
ar: عذرًا، لا تملك صلاحية دخول هذا المقرر من جهاز محمول

source: You must be enrolled in the course
ar: يجب أن تكون ملتحقًا بالمساق

source: You must be logged in to see this course
ar: يجب عليك تسجيل الدخول لمشاهدة هذا المقرر

source: This course is archived, which means you can review course content but it is no longer active.
ar: جرت أرشفة هذا المقرر، يمكنك مراجعة محتوى المقرر إلا أنه لم يعد مفعّلًا في الوقت الحاضر.

source: You lose all access to this course, including your progress.
ar: ستفقد كل صلاحيات الدخول إلى هذا المقرر، بما في ذلك مسار تقدمك.

source: You are still eligible to upgrade to a Verified Certificate! Pursue it to highlight the knowledge and skills you gain in this course.
ar: مازلت مؤهّلًا للترقية والحصول على شهادة موثّقة! اطلبها لتبرز المعارف والمهارات التي اكتسبتها بحضورك لهذا المقرر.

source: Unfortunately you missed this course's deadline for a successful verification.
ar: لسوء الحظ، لقد فاتك الموعد النهائي المحدّد لعملية التحقّق الناجحة الخاصّة بهذا المقرر.

source: There is no user with the username or email address "{user_identifier}" enrolled in this course.
ar: لا يوجد مستخدم باسم المستخدم أو عنوان البريد الإلكتروني "{user_identifier}" ملتحق بهذا المقرر.

source: This type of component cannot be shown while viewing the course as a specific student.
ar: بصفتك أحد الطلّاب، لا يمكن عرض هذا النوع من المكوّنات أثناء استعراض المقرر.

source: Disable the dynamic upgrade deadline for this course run.
ar: تعطيل الموعد النهائي للترقية الآلية لهذا المقرر.

source: Keep learners engaged and on track throughout the course.
ar: أبقِ المتعلمين على السكة و حافظ على مشاركتهم خلال كامل المقرر.

source: Create and manage a library of course readings, textbooks, and chapters.
ar: أنشئ و أدِر مكتبة من مقروءات المقرر، الكتب، و الفصول.

source: Provide an in-course calculator for simple and complex calculations.
ar: وفِّر آلة حاسبة أثناء الدورة التدريبية لإجراء العمليات الحسابية البسيطة والمعقدة.

source: Maintain exam integrity by enabling a proctoring solution for your course
ar: حافظ على نزاهة الامتحانات من خلال تفعيل وسيلة مراقبة لمساقك

source: Provide additional course content and resources with custom pages
ar: وفّر محتوى و موارد إضافية في مساقك عن طريق صفحات مخصصة

source: Course
ar: المقرر

source: You are not signed in. To see additional course content, {sign_in_link} or {register_link}, and enroll in this course.
ar: لم تقم بتسجيل الدخول. لمشاهدة محتوى إضافي، قم بتسجيل الدخول {sign_in_link} أو إنشاء حساب {register_link} ، والالتحاق بهذا المقرر.

source: You are enrolled in the audit track for this course. The audit track does not include a certificate.
ar: أنت الآن مسجل في مسار التدقيق لهذه الدورة. لا يتضمن مسار التدقيق شهادة.

source: You are enrolled in the honor track for this course. The honor track does not include a certificate.
ar: أنت مسجل في المسار التشريفي لهذا المقرر. لا يتضمن المسار التشريفي أية شهادة.

source: We're creating your certificate. You can keep working in your courses and a link to it will appear here and on your Dashboard when it is ready.
ar: جاري إنشاء شهادتك. يمكنك متابعة العمل في الدورات وسوف يظهر رابط لشهادتك هنا على لوح المعلومات عندما تصبح جاهزة.

source: Please contact your course team if you have any questions.
ar: تواصل مع فريق العمل الخاص بالدورة في حال كان لديك أية اسئلة .

source: You've earned a certificate for this course.
ar: لقد حصلت على شهادة في هذا المقرر.

source: After this course officially ends, you will receive an email notification with your certificate.
ar: عند انتهاء هذا المقرر بشكل رسمي ستصلك رسالة تنبيه عبر البريد الإلكتروني بشهادتك.

source: To see course content, {sign_in_link} or {register_link}.
ar: للاطلاع على محتوى المقرر، {sign_in_link} أو {register_link}.

source: You must be enrolled in the course to see course content.
ar: يجب أن تكون مسجلا في المقرر لمشاهدة المحتوى.

source: Course is not valid
ar: المقرر غير صالح

source: Your certificate will be available when you pass the course.
ar: ستصبح شهادتك متاحة بعد أن تنجح في المقرر.

source: {platform_name} now offers financial assistance for learners who want to earn Verified Certificates but who may not be able to pay the Verified Certificate fee. Eligible learners may receive up to 90{percent_sign} off the Verified Certificate fee for a course. To apply for financial assistance, enroll in the audit track for a course that offers Verified Certificates, and then complete this application. Note that you must complete a separate application for each course you take. We plan to use this information to evaluate your application for financial assistance and to further develop our financial assistance program.
ar: الآن، تقدّم منصّة {platform_name} خدمة الدعم المالي للمتعلّمين الراغبين بالحصول على شهادة موثّقة إلا أنهم قد لا يملكون القدرة المالية لدفع رسوم الحصول عليها. يمكن أن يحصل الطلاب المؤهلون على حسم يصل إلى 90 {percent_sign} من رسوم الحصول على شهادة موثّقة للمقرر. للتقدّم بطلب والحصول على دعم مالي، يُرجى التسجيل في المسار المراقب الخاص بالمساق ذا الشهادة الموثّقة، ومن ثم ملئ الطلب. يُرجى الانتباه إلى وجوب ملئ طلب منفضل لكل مقرر تحضره. ننوي استخدام هذه البيانات لتقييم طلبك للحصول على دعم مالي ونعمل على تطوير نظام الدعم المالي لدينا.

source: Tell us about your learning or professional goals. How will a Verified Certificate in this course help you achieve these goals?
ar: أخبرنا عن أهدافك العلمية والمهنيّة. كيف سيساعدك الحصول على شهادة موثّقة في تحقيق هذه الأهداف؟

source: Tell us about your plans for this course. What steps will you take to help you complete the course work and receive a certificate?
ar: أخبرنا عن خططك لهذا المقرر. ما هي الخطوات التي ستتّبعها لإتمام أعمال المقرر المطلوبة والحصول على شهادة؟

source: Select the course for which you want to earn a verified certificate. If the course does not appear in the list, make sure that you have enrolled in the audit track for the course.
ar: اختر المقرر الذي ترغب بالحصول على شهادة موثّقة له. في حال لم يظهر المقرر ضمن القائمة، يُرجى التأكّد من أنك قد سجّلت في مسار مراقب لهذا المقرر.

source: Course has no entrance exam section.
ar: لم يُعيّن للمقرر قسم خاص بامتحان الدخول.

source: Course has no valid entrance exam section.
ar: لم يُعيّن للمقرر قسم خاص بامتحان الدخول.

source: Certificate generation task for all students of this course has been started. You can view the status of the generation task in the "Pending Tasks" section.
ar: بدأت مهمّة إعداد الشهادات لجميع الطلّاب في هذا المقرر. يمكنك متابعة حالة مهمّة هذا الإعداد في قسم ’مهام الأستاذ القيد الانتظار‘.

source: The student {student} does not have certificate for the course {course}. Kindly verify student username/email and the selected course are correct and try again.
ar: لم يُمنح الطالب {student} شهادةً للمقرر {course}. يُرجى التأكّد من اسم المستخدم/عنوان البريد الإلكتروني للطالب ومن صحّة المقرر المُختار ثمّ المحاولة من جديد.

source: To gain insights into student enrollment and participation {link_start}visit {analytics_dashboard_name}, our new course analytics product{link_end}.
ar: لمزيدٍ من المعلومات حول تسجيل الطلّاب ومشاركتهم، يُرجى {link_start}زيارة {analytics_dashboard_name}، منتجنا الجديد لتحليلات المساقات{link_end}.

source: Please Enter the numeric value for the course price
ar: يُرجى إدخال قيمة عدّدية لتحديد سعر المقرر

source: Course Info
ar: معلومات المقرر

source: Could not find student enrollment in the course.
ar: تعذر العثور على تسجيل الطالب في المقرر.

source: Course Chrome
ar: متصفّح كروم للمقرر

source: Enter the tab that is selected in the XBlock. If not set, the Course tab is selected.
ar: ادخل التبويبة التي جرى اختيارها في ’XBlock‘. في حال لم تُضبط، سيجري اختيار تبويبة "المقرر".

source: If true, can be seen only by course staff, regardless of start date.
ar: عند اختيارك للقيمة ’true‘، سيُتاح المحتوى لطاقم المقرر فقط، بغض النظر عن تاريخ بدء المقرر.

source: The supplied course id {course_id} is not valid.
ar: إن الرقم التعريفي الذي أدخلته للمقرر {course_id} غير صحيح.

source: No teamset found in given course with given id
ar: لم يتم العثور على مجموعة فريق في مقرر معين بمعرف معين

source: The user {username} is not enrolled in the course associated with this team.
ar: إنّ المستخدم {username} غير مسجَّل في المقرر المرتبط بهذا الفريق.

source: The course for which this deadline applies
ar: المقرر الذي تنطبق عليه هذه المهلة النهائية.

source: This course doesn't support paid certificates
ar: لا يدعم هذا المقرر الشهادات مدفوعة القيمة.

source: To stop receiving email like this, update your course email settings
ar: لإيقاف تلقي بريد إلكتروني مثل هذا ، قم بتحديث إعدادات البريد الإلكتروني للدورة التدريبية

source: You may access your course.
ar: يمكنك الدخول إلى مساقك.

source: You may access your course at: %(course_url)s.
ar: يمكنك الدخول إلى مساقك على %(course_url)s.

source: The invitation has been sent by a member of the course staff.
ar: تم إرسال الدعوة من قبل أحد أعضاء هيئة التدريس بالمساق.

source: To start accessing course materials, please visit:
ar: للبدء بالاطلاع على مواد المقرر، يُرجى زيارة:

source: To enroll in this course and begin the beta test:
ar: للالتحاق بهذا المقرر والبدء في الاختبار التجريبي:

source: You have been invited to be a beta tester for %(course_name)s at %(site_name)s by a member of the course staff.
ar: قد تمت دعوتك من قِبل أحد أعضاء طاقم المقرر لتكون أحد مختبري الإصدار التجريبي لـ %(course_name)s في %(site_name)s .

source: To start accessing course materials, please visit %(course_url)s
ar: لبدء الوصول إلى مواد المقرر، يرجى زيارة %(course_url)s

source: Visit %(course_about_url)s to enroll in this course and begin the beta test.
ar: قم بزيارة %(course_about_url)s للالتحاق بالمساق والبدء في الاختبار التجريبي.

source: Visit %(site_name)s to enroll in this course and begin the beta test.
ar: قم بزيارة %(site_name)s للالتحاق بالمساق والبدء في الاختبار التجريبي.

source: You have been invited to join %(course_name)s at %(site_name)s by a member of the course staff.
ar: تمت دعوتك للانضمام إلى %(course_name)s في %(site_name)s بواسطة أحد أعضاء فريق عمل المقرر.

source: To access this course click on the button below and login:
ar: للدخول إلى هذا المقرر يُرجى النقر على الزر أدناه لتسجيل الدخول:

source: To access this course visit it and register:
ar: للدخول إلى هذا المقرر، يرجي زيارة الصفحة والالتحاق في المقرر:

source: Once you have registered and activated your account, you will be able to access this course:
ar: بمجرد تسجيل حسابك وتفعيله، ستتمكن من الدخول إلى هذا المقرر:

source: To access this course visit %(course_url)s and login.
ar: للدخول إلى هذا المقرر، قم بزيارة %(course_url)s وتسجيل الدخول.

source: To access this course visit %(course_about_url)s and register for this course.
ar: للدخول إلى هذا المقرر ، قم بزيارة %(course_about_url)sوالالتحاق بالمساق.

source: Once you have registered and activated your account, visit %(course_about_url)s to join this course.
ar: بمجرد تسجيل حسابك وتفعيله ، قم بزيارة %(course_about_url)s للالتحاق بالمساق.

source: You have been unenrolled from the course %(course_name)s by a member of the course staff. Please disregard the invitation previously sent.
ar: تم إلغاء تسجيلك من المقرر %(course_name)s بواسطة أحد أعضاء الطاقم. الرجاء تجاهل الدعوة المرسلة سابقا.

source: You have been unenrolled from %(course_name)s at %(site_name)s by a member of the course staff. This course will no longer appear on your %(site_name)s dashboard.
ar: لقد تم إلغاء تسجيلك من %(course_name)s في %(site_name)sبواسطة أحد أعضاء طاقم المقرر. لن يظهر هذا المقرر بعد الآن على لوحة معلومات %(site_name)s.

source: Your other courses have not been affected.
ar: لم يؤثر ذلك على باقي المقررات.

source: You have been enrolled in %(course_name)s at %(site_name)s by a member of the course staff. This course will now appear on your %(site_name)s dashboard.
ar: لقد تم تسجيلك في %(course_name)s في %(site_name)sبواسطة أحد أعضاء طاقم المقرر. سيظهر هذا المقرر الآن على لوحة معلومات %(site_name)s

source: Access the Course Materials Now
ar: احصل على حق الدخول إلى مواد المقرر الآن

source: You have been removed as a beta tester for %(course_name)s at %(site_name)s by a member of the course staff.
ar: لقد تمت إزالتك كمختبِر تجريبي لـ %(course_name)s في %(site_name)s بواسطة أحد أعضاء طاقم المقرر.

source: This course will remain on your dashboard, but you will no longer be part of the beta testing group.
ar: سيبقى هذا المقرر في لوحة المعلومات الخاصة بك ، لكنك لن تكون جزءًا من مجموعة الاختبار التجريبي.

source: You have been removed as a beta tester for %(course_name)s at %(site_name)s by a member of the course staff. This course will remain on your dashboard, but you will no longer be part of the beta testing group.
ar: لقد تمت إزالتك كمختبِر تجريبي لـ %(course_name)s في %(site_name)sبواسطة أحد أعضاء فريق طاقم المقرر. سيبقى هذا المقرر في لوحة المعلومات الخاصة بك، لكنك لن تكون جزءًا من مجموعة الاختبار التجريبي.

source: These permissions will be granted for data from your courses associated with the following content providers:
ar: سيتم منح هذه الصلاحيات للبيانات من المقررات المرتبطة بمزودي المحتوى التاليين:

source: View Course
ar: عرض المقرر

source: Courses
ar: مقررات

source: Username created for Course Catalog Integration, e.g. lms_catalog_service_user.
ar: تم إنشاء اسم المستخدم لدمج كتالوج الدورة التعليمية، على سبيل المثال، lms_catalog_service_user.
