Repository: nelc/futurex-translations
Catalog: translation-overrides/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: If dashboard social sharing and custom course URLs are enabled, you can provide a URL (such as the URL to a course About page) that social media sites can link to. URLs must be fully qualified. For example: http://www.edx.org/course/Introduction-to-MOOCs-ITM001
ar: في حال جرى تفعيل كل من رابط مشاركة مواقع التواصل الاجتماعي ورابط المقرر المخصَّص في لوحة المعلومات، يمكنك توفير رابط (كرابط صفحة ’لمحة عن المقرر‘) يُتيح الوصول إلى مواقع التواصل الاجتماعي. يجب أن تكون جميع الروابط بصيغة صحيحة. مثلًا: http://www.edx.org/course/Introduction-to-MOOCs-ITM001

source: Course Language
ar: لغة المقرر

source: Specify the language of your course.
ar: حدّد لغة المقرر

source: Configure team sets, limit team sizes, and set visibility settings using JSON. See <a target="&#95;blank" href="https://edx.readthedocs.io/projects/edx-partner-course-staff/en/latest/course_features/teams/teams_setup.html#enable-and-configure-teams">teams configuration documentation</a> for help and examples.
ar: قم بتشكيل مجموعات الفريق وتحديد أحجام الفريق وتعيين إعدادات الرؤية باستخدام JSON. راجع<a target="&#95;blank" href="https://edx.readthedocs.io/projects/edx-partner-course-staff/en/latest/course_features/teams/teams_setup.html#enable-and-configure-teams">وثائق تكوين الفِرق </a>للحصول على التعليمات والأمثلة.

source: Enter true or false. If this value is true, proctored exams are enabled in your course. Note that enabling proctored exams will also enable timed exams.
ar: يُرجى إدخال ’true‘ أو ’false‘. تشير القيمة ’true‘ إلى تفعيل الامتحانات المراقبة لهذا المقرر. وانتبه إلى أن تفعيلك للامتحانات المراقبة سيفعّل بدوره الامتحانات محدَّدة التوقيت أيضًا.

source: Enter the proctoring provider you want to use for this course run. Choose from the following options: {available_providers}.
ar: أدخل مزود المراقبة الذي تريد استخدامه لتشغيل هذا المقرر. اختر من بين الخيارات التالية: {available_providers}.

source: Enter true or false. If this value is true, learners can choose to take proctored exams without proctoring. If this value is false, all learners must take the exam with proctoring. This setting only applies if proctored exams are enabled for the course.
ar: أدخل صحيح أو خاطئ. إذا كان الخيار صحيح، سيتم تفعيل الامتحانات المُراقبة دون مراقبة. إذا كان هذا الخيار خاطئ يجب على كل الطلاب الخضوع للامتحان تحت الرقابة. يتم تفعيل هذا الإعداد فقط إذا تم تحديد خيار تفعيل الامتحانات المُراقبة في الدورة.

source: Enter true or false. If this value is true, timed exams are enabled in your course. Regardless of this setting, timed exams are enabled if Enable Proctored Exams is set to true.
ar: أدخل صحيح أو خاطئ. إذا كان الخيار صحيح، سيتم تفعيل الامتحانات الموقته في دورتك. بغض النظر عن هذا الإعداد، يتم تفعيل الامتحانات الموقتة إذا تم تحديد خيار تفعيل الامتحانات الموقتة.

source: The minimum grade that a learner must earn to receive credit in the course, as a decimal between 0.0 and 1.0. For example, for 75%, enter 0.75.
ar: الدرجة الدنيا التي يجب أن يحصل عليها المتعلِّم لنيل تقدير للمقرر، تُحتسب كقيمة عشرية بين 0.0 و1.0. ومثلًا، تُدخل القيمة 0.75 للتعبير عن درجة 75%.

source: Set this to "true" to mark this course as self-paced. Self-paced courses do not have due dates for assignments, and students can progress through the course at any rate before the course ends.
ar: يُرجى ضبط هذه على القيمة ’true‘ لجعل هذا المقرر كمساق تعلّم ذاتي. لا يُحدّد، في مقررات التعلّم الذاتي، تاريخ لتسليم الفروض كما ويُسمح للمتعلّمين التقدّم في مواد المقرر بأي سرعة وفي أي وقت يسبق نهاية المقرر.

source: Course Learning Information
ar: معلومات عن تعلم الدورة التدريبية

source: Specify what student can learn from the course.
ar: حدد ما يمكن أن يتعلمه الطلاب في هذه الدورة التدريبية.

source: Course Visibility For Unenrolled Learners
ar: إمكانية مشاهدة الدورة للمتعلمين غير المسجلين

source: Defines the access permissions for unenrolled learners. This can be set to one of three values: 'private' (default visibility, only allowed for enrolled students), 'public_outline' (allow access to course outline) and 'public' (allow access to both outline and course content).
ar: تحدِّد هذه القيمة صلاحيات الدخول للمتعلمين غير الملتحقين. يمكن ضبطها وفق أحد الخيارات الثلاث: "خاص" (إمكانية مشاهدة افتراضية ، مسموح بها فقط للمتعلمين الملتحقين) ، "مخطط_عام" (السماح بالوصول إلى مخطط المقرر) و "عام" (السماح بالوصول إلى كل من المخطط ومحتوى المقرر).

source: Course Instructor
ar: مدرّس الدورة التدريبية

source: Enter the details for Course Instructor
ar: أدخل معلومات مدرس الدورة التدريبية

source: Enter true or false. If true, you can add unsupported problems and tools to your course in Studio. Unsupported problems and tools are not recommended for use in courses due to non-compliance with one or more of the base requirements, such as testing, accessibility, internationalization, and documentation.
ar: أدخل صح أو خطأ. في حالة صح، يمكنك إضافة المسائل والأدوات غير المدعومة لدورتك التدريبية في Studio. لا ينصح باستخدام المسائل والأدوات غير المدعومة في دورتك التدريبية بسبب عدم الامتثال مع واحد أو أكثر من الشروط الأساسية، مثل الاختبار وسهولة الوصول والتدويل والتوثيق.

source: Enter true or false. If true, any highlights associated with content in the course will be messaged to learners at their scheduled time.
ar: أدخل صواب أو خطأ. إذا كان إدخالك صواب ، سيتم إرسال أي لمحات او نقاط بارزة مرتبطة بالمحتوى في المقرر إلى المتعلمين في الوقت المحدد.

source: Other Course Settings
ar: الإعدادات الأخرى للمقرر

source: Any additional information about the course that the platform needs or that allows integration with external systems such as CRM software. Enter a dictionary of values in JSON format, such as { "my_custom_setting": "value", "other_setting": "value" }
ar: أي معلومات إضافية حول المقرر التي يحتاجها النظام الأساسي أو تسمح بالتكامل مع الأنظمة الخارجية مثل برنامج CRM. أدخل قاموس القيم بتنسيق JSON ، مثل { "my_custom_setting": "value", "other_setting": "value" }

source: A category name for the discussion. This name appears in the left pane of the discussion forum for the course.
ar: هو اسم فئة النقاشات. يظهر هذا الاسم على الجانب الأيسر من منتدى النقاشات الخاص بالمساق.

source: A subcategory name for the discussion. This name appears in the left pane of the discussion forum for the course.
ar: اسم الفئة الفرعية في النقاشات. يظهر هذا الاسم في الجانب الأيسر من منتدى النقاشات الخاص بالمساق.

source: You are not signed in. To view the discussion content, {sign_in_link} or {register_link}, and enroll in this course.
ar: لم تقم بتسجيل الدخول. لعرض محتوى المناقشة ، {sign_in_link} أو {register_link} ، والتسجيل في هذا المقرر.

source: If you select this option, only course team members with the Staff or Admin role see this page.
ar: إذا قمت بتحديد هذا الخيار، سيتمكن أعضاء فريق الدورة من المشرفين والطاقم فقط برؤية هذه الصفحة.

source: List of course update items
ar: لائحة بعناصر تحديث المقرر

source: This course does not support content libraries. Contact your system administrator for more information.
ar: لا يدعم هذا المقرر مكتبات محتوى. يُرجى الاتّصال بمسؤول النظام للحصول على مزيد من المعلومات.

source: Enter the URL for the course data GIT repository.
ar: يُرجى إدخال رابط مستودع نظام GIT لبيانات المقرر.

source: Specify the default for how often variable values in a problem are randomized. This setting should be set to "never" unless you plan to provide a Python script to identify and randomize values in most of the problems in your course. Valid values are "always", "onreset", "never", and "per_student".
ar: يُرجى تحديد الإعداد الافتراضي للمرّات التي تُرتَّب فيها القيم المتغيِّرة ترتيبًا عشوائيًا. يجب ضبط هذا الإعداد على "نهائيًا" ما لم تكن تخطِّط لتوفير برنامج نصّي بايثون لتحديد القيم وترتيبها بطريقة عشوائية في معظم مسائل مساقك. والقيم الصالحة هي ’دائمًا‘، و’قيد إعادة الضبط‘ و’نهائيًا‘، و’لكل_طالب‘.

source: Enter the number of days before the start date that beta users can access the course.
ar: إدخال عدد الأيّام السابقة لتاريخ البدء والتي يمكن لمستخدمي بيتا الدخول فيها إلى المقرر.

source: Enter the maximum number of times a student can try to answer problems. By default, Maximum Attempts is set to null, meaning that students have an unlimited number of attempts for problems. You can override this course-wide setting for individual problems. However, if the course-wide setting is a specific number, you cannot set the Maximum Attempts for individual problems to unlimited.
ar: يُرجى إدخال عدد المحاولات الأقصى المسموح للطالب للإجابة عن المسائل. يُعيّن هذا العدد، في الوضع الافتراضي، على القيمة "null"، بمعنى أنّه يُتاح للطالب عدد محاولات غير محدود. يمكنك تغيير هذا الإعداد بحيث ينطبق على مسائل محدّدة في المقرر دون سواها. في حين أنه، إذا ضُبطت عدد المحاولات لجميع مسائل المقرر، فلا يمكنك ضبط بعض المسائل ليُسمح فيها بعدد محاولات غير محدود.

source: Enter the API key provided by MathWorks for accessing the MATLAB Hosted Service. This key is granted for exclusive use in this course for the specified duration. Do not share the API key with other courses. Notify MathWorks immediately if you believe the key is exposed or compromised. To obtain a key for your course, or to report an issue, please contact moocsupport@mathworks.com
ar: يُرجى إدخال مفتاح واجهة برمجة التطبيقات، الذي تقدّمه شركة ماثووركس، لاستخدام الخدمة المستضافة بلغة MATLAB. ويُمنح هذا المفتاح للاستخدام الحصري في هذا المقرر خلال مدّة محدّدة. يُرجى عدم استخدام مفتاح واجهة برمجة التطبيقات في مقررات أخرى، وإبلاغ ماثووركس فورًا إذا كنت تعتقد بأنّ المفتاح أصبح مكشوفًا. للحصول على مفتاح لمساقك، أو للإبلاغ عن مشكلة ما، يُرجى مراسلة الشركة على هذا العنوان moocsupport@mathworks.com.

source: Identify a video, 5-10 seconds in length, to play before course videos. Enter the video ID from the Video Uploads page and one or more transcript files in the following format: {format}. For example, an entry for a video with two transcripts looks like this: {example}
ar: حدّد فيديو، بطول 5-10 ثوانٍ، لتشغيله قبل فيديوهات المقرر. أدخل الرقم التعريفي للفيديو من خلال صفحة ’تحميلات الفيديو‘ بالإضافة إلى ملف نصّوص واحد أو أكثر وذلك وفق الصيغة التالية: {format}. مثال، ستبدو الصيغة المُدخلة لملف فيديو ذا نصيّ كلام مدوّن بالشكل: {example}.

source: Enter true or false. If true, problems in the course default to always displaying a 'Reset' button. You can override this in each problem's settings. All existing problems are affected when this course-wide setting is changed.
ar: يُرجى إدخال ’true‘ أو ’false‘. باختيارك للقيمة ’true‘، ستعرض مسائل المقرر زر ’إعادة الضبط‘ بشكل افتراضي. يمكنك تجاوز هذا الإعداد بتعديل إعدادات كل مسألة على حدى. ستتأثّر جميع المسائل الموجودة بتغيير هذا الإعداد الذي يؤثّر على جميع أقسام المقرر.

source: Indicates whether Student Notes are visible in the course. Students can also show or hide their notes in the courseware.
ar: يحدّد فيما إذا كانت ملاحظات الطلّاب مرئيّة في المقرر. كما ويمكن للطلّاب اختيار إظهار أو إخفاء ملاحظاتهم في محتويات المقرر.

source: Because the course has ended, this assignment is hidden from the learner.
ar: بسبب انتهاء المقرر، تم إخفاء هذه المهمة عن المتعلم.

source: {display_name} is only accessible to enrolled learners. Sign in or register, and enroll in this course to view it.
ar: {display_name} متاح فقط للمتعلمين المسجلين. قم بتسجيل الدخول أو التسجيل ، والتسجيل في هذا المقرر لمشاهدته.

source: Course team user does not exist
ar: مستخدم فريق المقرر غير موجود

source: Invalid course update id.
ar: الرمز التعريفي الخاص بتحديث المقرر غير صحيح.

source: Course update not found.
ar: تحديث المقرر غير موجود.

source: Aborting import because a course with this id: {} already exists.
ar: يجري الغاء عملبة لاستيراد لان مقرر مع رقم التعريف هذا :{} موجود بالفغل

source: If using http urls, you must provide the username and password in the url. Similar to https://user:pass@github.com/user/course.
ar: في حال استخدام الروابط وفق بروتوكول http، فإنّه يجب ذكر اسم المستخدم وكلمة المرور في الرابط، كما يلي https://user:pass@github.com/user/course.

source: Unable to export course to xml.
ar: تعذّر تصدير المقرر إلى ملف بصيغة xml.

source: Bad course location provided
ar: موقع المقرر الذي تم تقديمه غير صحيح

source: Take the specified course and attempt to export it to a git repository . Course directory must already be a git repository. Usage: git_export <course_loc> <git_url>
ar: خذ المقرر المحدّد وحاول أن تصدّره إلى مستودع git . يجب أن يكون دليل المقرر هو أصلًا مستودع git. الاستخدام: git_export <course_loc> <git_url>

source: Students must score {score}{pct_sign} or higher to access course materials.
ar: يجب أن يحصل الطلّاب على درجة {score}{pct_sign} أو ما فوق ليتمكّنوا من الوصول إلى مواد المقرر.

source: Course has been successfully reindexed.
ar: جرى إعادة فهرسة المقرر بنجاح.

source: Special characters not allowed in organization, course number, and course run.
ar: لا يُسمح باستخدام الأحرف الخاصة ضمن اسم المنظمة و رقم المقرر و رقم تشغيله.

source: There is already a course defined with the same organization and course number. Please change either organization or course number to be unique.
ar: يوجد من قبل مقرر يحمل اسم المؤسّسة ورقم المقرر نفسهما. يُرجى تغيير إمّا المؤسّسة أو رقم المقرر ليكون فريدًا.

source: Please change either the organization or course number so that it is unique.
ar: يُرجى تغيير إمّا اسم المنظمة أو رقم المقرر ليكون فريدًا.

source: Unable to create course '{name}'. {err}
ar: تعذّر إنشاء المقرر ’{name}‘. {err}

source: You must link this course to an organization in order to continue. Organization you selected does not exist in the system, you will need to add it to the system
ar: يجب ربط هذا المقرر بمؤسّسة لتتمكّن من المتابعة. إن المؤسّسة التي اخترتها غير موجودة ضمن النظام وهو ما سيتطلّب منك إضافتها إلى النظام.

source: Invalid prerequisite course key
ar: رقم المقرر الأساسي غير صالح

source: Completed Course Entrance Exam
ar: استُكمِل امتحان دخول المقرر

source: Course successfully exported to git repository
ar: جرى بنجاح تصدير المقرر إلى مستودع git

source: Current course creator state
ar: الحالة الحالية لمُنشئ المقرر

source: Optional notes about this user (for example, why course creation access was denied)
ar: ملاحظات اختيارية حول هذا المستخدم (لماذا مثلًا رُفض طلب الدخول لإنشاء مقرر)

source: Force Publish Course
ar: تنفيذ نشر الدورة التدريبية

source: Sometimes the draft and published branches of a course can get out of sync. Force publish course command resets the published branch of a course to point to the draft branch, effectively force publishing the course. This view dry runs the force publish command
ar: في بعض الأحيان، تكون الفروع المنشورة ومسودات الدورة التدريبية غير متزامنة. يقوم أمر التنفيذ بنشر الدورة التدريبية بإعادة تعيين الفرع المنشور للدورة التدريبية للإشارة إلى فرع المسودة، مما ينفذ النشر للدورة بشكل فعال. يقدم هذا العرض اختبارًا تجريبيًا لأمر تنفيذ النشر

source: Please provide course id.
ar: يرجى تقديم معرف للدورة التدريبية.

source: Invalid course key.
ar: مفتاح الدورة التدريبية غير صالح.

source: No matching course found.
ar: لم يتم العثور على دورة تدريبية مطابقة.

source: Force publishing course is not supported with old mongo courses.
ar: تنفيذ نشر الدورة التدريبية غير مدعوم مع الدورات التدريبية القديمة.

source: Course is already in published state.
ar: الدورة التدريبية في حالة نشر بالفعل.

source: Course Name
ar: اسم المقرر

source: Course Number
ar: رقم المقرر

source: Course Number:
ar: رقم المقرر:

source: Course Run:
ar: تشغيل المقرر:

source: View all Courses
ar: عرض جميع المقررات

source: Click to load all enrolled courses
ar: أنقر لتحميل جميع الدورات الملتحق بها

source: You are not enrolled in any courses yet.
ar: لست ملتحقًا بأية مقررات بعد.

source: Explore courses
ar: تصفح المقررات

source: Course-loading errors
ar: الأخطاء الخاصة بتحميل المساقات

source: Search Your Courses
ar: ابحث في مساقاتك

source: Receive course emails
ar: استلام رسائل البريد الإلكتروني الخاصة بالمساق

source: Course:
ar: المقرر:

source: The course has ended.
ar: انتهت هذه الدورة التعليمية.

source: Because the course has ended, this assignment is no longer available.{line_break}If you have completed this assignment, your grade is available on the {link_start}progress page{link_end}.
ar: لم تعد هذه المهمة متوفرة لانتهاء المقرر.{line_break}إذا كنت قد أكملت هذه المهمة يمكنك رؤية علامتك على {link_start}progress page{link_end}.

source: Search for a course
ar: البحث عن مقرر

source: Course View
ar: استعراض المقرر

source: View this course as:
ar: مشاهدة هذا المقرر كـ:

source: You are now viewing the course as {i_start}{user_name}{i_end}.
ar: أنت الآن تستعرض المقرر بصفتك {i_start}{user_name}{i_end}.

source: Your secondary email has been activated. Please visit {link_start}dashboard{link_end} for courses.
ar: تم تنشيط بريدك الإلكتروني الثانوي. يرجى زيارة {link_start} لوحة المعلومات {link_end} للمقررات.

source: Your request to access the {platform_name} Course Catalog API is being processed. You will receive a message at the email address in your profile when processing is complete. You can also return to this page to see the status of your API access request.
ar: تجري معالجة طلبك للوصول إلى واجهة برمجة تطبيقات مساقات {platform_name}. سوف تستلم رسالة على عنوان البريد الإلكتروني الموجود في الملف الشخصي الخاص بك عند اكتمال عملية المعالجة. يمكنك أيضاً الرجوع إلى هذه الصفحة للاطلاع على حالة طلبك للوصول إلى واجهة برمجة التطبيقات.

source: Your request to access the {platform_name} Course Catalog API has been denied. If you think this is an error, or for other questions about using this API, contact {api_support_email_link}.
ar: تم رفض طلبك للوصول إلى واجهة برمجة تطبيقات مساقات {platform_name}. إذا كنت تعتقد أن هذا خطأ، أو إذا كانت لديك استفسارات أخرى بشأن استخدام واجهة برمجة التطبيقات هذه، فاتصل ب{api_support_email_link}.

source: Your request to access the {platform_name} Course Catalog API has been approved.
ar: تم اعتماد طلبك للوصول إلى واجهة برمجة تطبيقات مساقات {platform_name}.

source: To learn more about the {platform_name} Course Catalog API, visit {link_start}our API documentation page{link_end}. For questions about using this API, contact {api_support_email_link}.
ar: لمعرفة المزيد عن واجهة برمجة تطبيقات مساقات {platform_name}، فقم بزيارة {link_start}صفحة معلومات واجهة برمجة التطبيقات{link_end}. للإجابة على الأسئلة التي تدور حول استخدام واجهة برمجة التطبيقات هذه، اتصل ب{api_support_email_link}.

source: Welcome to {platform_name}. Thank you for using {platform_name}'s Course Discovery API, Enterprise API and/or any additional APIs that we may offer from time to time (collectively, the "APIs"). Please read these Terms of Service prior to accessing or using the APIs. These Terms of Service, any additional terms within accompanying API documentation, and any applicable policies and guidelines that {platform_name} makes available and/or updates from time to time are agreements (collectively, the "Terms") between you and {platform_name}. These Terms are issued under the enterprise product agreement, member participation agreement, or other direct agreement governing the purchase of {platform_name} products, if any (the "Agreement"), executed by you or the party on whose behalf you are accessing or using the APIs and {platform_name}. In the event that you have such an Agreement that applies to your use of the APIs, the Agreement will control in the event of any conflict between it and these Terms. By accessing or using the APIs, you accept and agree to be legally bound by the Terms, whether or not you are a registered user. If you are accessing or using the APIs on behalf of a company, organization or other legal entity, you are agreeing to these Terms for that entity and representing and warranting to {platform_name} that you have full authority to accept and agree to these Terms for such entity, in which case the terms "you," "your" or related terms herein shall refer to such entity on whose behalf you are accessing or using the APIs. If you do not have such authority or if you do not understand or do not wish to be bound by the Terms, you should not use the APIs.
ar: مرحباً بك في {platform_name}. نشكرك على استخدام واجهة برمجة تطبيقات Discovery API في {platform_name} و / أو واجهة برمجة تطبيقات للمؤسسات و / أو أي واجهات برمجة تطبيقات إضافية قد نقدمها من وقت لآخر (بشكل جماعي ، "واجهات برمجة التطبيقات"). يرجى قراءة شروط الخدمة هذه قبل الوصول إلى واجهات برمجة التطبيقات أو استخدامها. شروط الخدمة هذه ، وأي شروط إضافية ضمن وثائق واجهة برمجة التطبيقات المصاحبة ، وأي سياسات وإرشادات سارية توفرها {platform_name} و / أو تحديثات من وقت لآخر هي اتفاقيات (يُشار إليها إجمالاً باسم "الشروط") بينك وبين {platform_name}. يتم إصدار هذه الشروط بموجب اتفاقية منتج المؤسسة ، أو اتفاقية مشاركة الأعضاء ، أو اتفاقية مباشرة أخرى تنظم شراء منتجات {platform_name} ، إن وجدت ("الاتفاقية") ، التي تنفذها أنت أو الطرف الذي تقوم بالوصول إليه أو تستخدمه واجهات برمجة التطبيقات و {platform_name}. في حالة وجود مثل هذه الاتفاقية التي تنطبق على استخدامك لواجهات برمجة التطبيقات ، ستتحكم الاتفاقية في حالة وجود أي تعارض بينها وبين هذه الشروط. من خلال الوصول إلى واجهات برمجة التطبيقات أو استخدامها ، فإنك تقبل وتوافق على الالتزام القانوني بالشروط ، سواء كنت مستخدماً مسجلاً أم لا. إذا كنت تدخل إلى APIs أو تستخدمها نيابة عن شركة أو مؤسسة أو كيان قانوني آخر ، فأنت توافق على هذه الشروط لذلك الكيان وتقر وتضمن لـ {platform_name} أن لديك السلطة الكاملة لقبول هذه الشروط والموافقة عليها هذا الكيان ، وفي هذه الحالة ، تشير المصطلحات "أنت" و "الخاصة بك" أو المصطلحات ذات الصلة هنا إلى هذا الكيان الذي تقوم بالوصول إلى APIs أو تستخدمه نيابة عنه. إذا لم يكن لديك مثل هذه السلطة أو إذا لم تفهم الشروط أو لا ترغب في الالتزام بالشروط ، فيجب ألا تستخدم واجهات برمجة التطبيقات.

source: All names, logos and seals ("Trademarks") that appear in the APIs, API Content, or on or through the services made available on or through the APIs, if any, are the property of their respective owners. You may not remove, alter, or obscure any copyright, Trademark, or other proprietary rights notices incorporated in or accompanying the API Content. If any {platform_name} Participant (as hereinafter defined) or other third party revokes access to API Content owned or controlled by that {platform_name} Participant or third party, including without limitation any Trademarks, you must ensure that all API Content pertaining to that {platform_name} Participant or third party is deleted from Your Application and your networks, systems and servers as soon as reasonably possible. "{platform_name_capitalized} Participants" means MIT, Harvard, and the other entities providing information, API Content or services for the APIs, the course instructors and their staffs.
ar: جميع الأسماء والشعارات والأختام ("العلامات التجارية") التي تظهر في واجهات برمجة التطبيقات أو محتوى واجهة برمجة التطبيقات أو في أو من خلال الخدمات المتاحة على واجهات برمجة التطبيقات أو من خلالها ، إن وجدت ، هي ملك لأصحابها. لا يجوز لك إزالة أو تغيير أو إخفاء أي حقوق نشر أو علامة تجارية أو غيرها من إشعارات حقوق الملكية المضمنة في محتوى API أو المصاحبة له. إذا ألغى أي مشارك {platform_name} (كما هو موضح فيما يلي) أو جهة خارجية أخرى الوصول إلى محتوى واجهة برمجة التطبيقات الذي يملكه أو يتحكم فيه ذلك المشارك {platform_name} أو طرف ثالث ، بما في ذلك على سبيل المثال لا الحصر أي علامات تجارية ، فيجب عليك التأكد من أن جميع محتوى واجهة برمجة التطبيقات المتعلقة بذلك {platform_name} يتم حذف المشارك أو الجهة الخارجية من تطبيقك والشبكات والأنظمة والخوادم الخاصة بك في أقرب وقت ممكن. يُقصد بمصطلح "{platform_name_capitalized} المشاركون" معهد ماساتشوستس للتكنولوجيا وهارفارد والكيانات الأخرى التي توفر المعلومات أو محتوى واجهة برمجة التطبيقات أو الخدمات لواجهات برمجة التطبيقات ومعلمي الدورة وموظفيها.

source: You will still receive course emails from other courses you are enrolled in.
ar: ستستمر في تلقي رسائل البريد الإلكتروني الخاصة بالمساقات الأخرى التي قمت بالتسجيل فيها.

source: For advanced users only. Errors in the grading policy can lead to the course failing to display. This form does not check the validity of the policy before saving.
ar: للمستخدمين المتقدمين فقط. قد تؤدي الأخطاء في سياسة التقييم إلى فشل عرض المقرر. لا تتحقق هذه الاستمارة من صلاحية السياسة قبل الحفظ.
