Repository: nelc/futurex-translations
Catalog: translation-overrides/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: These define the context to enable this configuration on. If no values are set, then the configuration applies globally. If a single value is set, then the configuration applies to all courses within that context. At most one value can be set at a time.{br}If multiple contexts apply to a course (for example, if configuration is specified for the course specifically, and for the org that the course is in, then the more specific context overrides the more general context.
ar: هذه تحدد السياق لتمكين هذا التشكيل. إذا لم يتم تعيين أي قيم ، فسيتم تطبيق التشكيل بشكل عام. إذا تم تعيين قيمة واحدة، فسيتم تطبيقه على جميع المقررات في هذا السياق. يمكن تعيين قيمة واحدة على الأكثر في كل مرة. {br} إذا تم تطبيق سياقات متعددة على مقرر (على سبيل المثال، إذا تم تحديد التشكيل للمقرر على وجه التحديد، وللمؤسسة التييوجد بها المقرر، فإن السياق الأكثر تحديدًا يتجاوز السياق العام.

source: If any of these values are left empty or "Unknown", then their value at runtime will be retrieved from the next most specific context that applies. For example, if "Enabled" is left as "Unknown" in the course context, then that course will be Enabled only if the org that it is in is Enabled.
ar: إذا تم ترك أي من هذه القيم فارغة أو "غير معروف"، فسيتم استرداد قيمتها في وقت التشغيل من السياق التالي الأكثر تحديدًا الذي ينطبق. على سبيل المثال، إذا تم ترك "ممكّن" كـ "غير معروف" في سياق المقرر، فلن يتم تمكين هذا المقرر إلا إذا تم تمكين المؤسسة الموجودة فيها.

source: %(value)s should have the form ORG+COURSE
ar: %(value)s يجب أن يكون على شكل ORG + COURSE

source: Configure values for all course runs associated with this site.
ar: تكوين القيم لجميع المساقات المرتبطة بهذا الموقع.

source: Configure values for all course runs associated with this Organization. This is the organization string (i.e. edX, MITx).
ar: تكوين القيم لجميع المساقات المرتبطة بهذه المنظمة. هذه هي سلسلة المؤسسة (مثل edX ، MITx).

source: Course in Org
ar: المقرر في المؤسسة

source: Configure values for all course runs associated with this course. This is should be formatted as 'org+course' (i.e. MITx+6.002x, HarvardX+CS50).
ar: تشكيل القيم لجميع المساقات المرتبطة بهذا المقرر. يجب أن يتم تنسيق هذا كـ "org + course" (على سبيل المثال MITx + 6.002x، HarvardX + CS50).

source: Course Run
ar: تشغيل المقرر

source: Configure values for this course run. This should be formatted as the CourseKey (i.e. course-v1://MITx+6.002x+2019_Q1)
ar: تشكيل القيم لهذا المقرر يجب تنسيق هذا كـ CourseKey (على سبيل المثال ، course-v1: //MITx+6.002x+2019_Q1)

source: Course Credit Eligibility
ar: الأهلية لمواد المقرر الدراسيّة

source: [{course_key}] is not a valid course key.
ar: مفتاح المقرر [{course_key}] غير صحيح

source: Plain text or html content for displaying further steps on receipt page *after* paying for the credit to get credit for a credit course against a credit provider.
ar: نصّ غير مشفّر أو مكتوب بلغة html لعرض خطوات إضافية على صفحة الإيصال "بعد" دفع ثمن الوحدة الدراسية للمزوِّد للحصول على اعتماد لوحدات المقرر الدراسية.

source: Plain text or html content for displaying custom message inside credit receipt email content which is sent *after* paying to get credit for a credit course.
ar: نصّ غير مشفّر أو مكتوب بلغة html لعرض رسالة مخصَّصة كجزء من محتوى رسالة البريد الإلكتروني المرسَلة بخصوص إيصال دفعة الوحدة الدراسية والتي تُرسل "بعد" سداد القيمة لتلقّي اعتماد مادّة مقرر ذا وحدات دراسية معتمدة.

source: If disabled, the discussions in the associated learning context/course will be disabled.
ar: إذا تم تعطيله، فسيتم تعطيل المناقشات في سياق / برنامج التعلم ذي الصلة.

source: Encourage participation and engagement in your course with discussions.
ar: شجع المشاركة في مساقك باستخدام المناقشات.

source: COURSE NOT FOUND. Please check that the course ID is valid.
ar: عذرًا، لم نتمكّن من إيجاد المقرر. يُرجى التأكّد من صحّة الرقم التعريفي للمقرر.

source: The course key for the restricted course.
ar: رقم المقرر للمقرر المحجوز

source: The message to show when a user is blocked from accessing a course.
ar: الرسالة الواجب عرضها عندما يُمنَع المستخدم من الوصول إلى المقرر.

source: Allow users who enrolled in an allowed country to access restricted courses from excluded countries.
ar: السماح للمستخدمين المسجّلين والمقيمين في بلد مسموح بالوصول إلى المقررات المقيَّدة من البلدان المحظورة.

source: Whether to include or exclude the given course. If whitelist countries are specified, then ONLY users from whitelisted countries will be able to access the course. If blacklist countries are specified, then users from blacklisted countries will NOT be able to access the course.
ar: سواء سيُدرج أو يٌستثنى مقرر معيَّن. إذا جرى تحديد بلدان اللائحة البيضاء، ستقتصر سماحية الوصول إلى المقرر على طلاب هذه البلدان فقط. ومن جهة أخرى، إذا جرى تحديد بلدان اللائحة السوداء، فلن يٌسمح للطلاب من هذه البلدان بالوصول إلى المقرر.

source: The course to which this rule applies.
ar: المقرر الذي تنطبق عليه هذه القاعدة

source: Whitelist {country} for {course}
ar: أدرج {country} على اللائحة البيضاء للمقرر {course}

source: Blacklist {country} for {course}
ar: أردج {country} على اللائحة السوداء للمقرر {course}

source: Schedule start < course start
ar: جدول البدء < بدء المقرر

source: Course Id
ar: رقم المقرر

source: Course ID
ar: الرقم التعريفي للمقرر

source: With self-paced courses, you learn on your own schedule. We encourage you to spend time with the course each week. Your focused attention will pay off in the end!
ar: مع المقررات الذاتية ، سوف تتعلم في الجدول الزمني الخاص بك. نحن نشجعك على قضاء بعض الوقت مع المقرر التدريبي كل أسبوع. اهتمامك المركز سيؤتي ثماره في النهاية!

source: Resume your course now
ar: استئناف المقرر الآن

source: We encourage you to spend time with the course each week. Your focused attention will pay off in the end!
ar: نحن نشجعك على قضاء الوقت مع المقرر بشكل أسبوعي. تركيزك سيؤتي ثماره في النهاية!

source: Remember when you enrolled in %(course_name)s, and other courses on %(platform_name)s? We do, and we’re glad to have you! Come see what everyone is learning.
ar: هل تذكر عندما سجلت في %(course_name)s ، ومساقات أخرى في%(platform_name)s؟ نعم ، نحن سعداء بوجودك! تعال واطلع على ما يتعلمه الجميع.

source: Remember when you enrolled in {start_strong}{course_name}{end_strong}, and other courses on {platform_name}? We do, and we’re glad to have you! Come see what everyone is learning.
ar: هل تتذكر عندما سجلت في {start_strong} {course_name} {end_strong} ومساقات أخرى على {platform_name}؟ نحن نتذكر ، ويسعدنا أن تكون معنا! تعال واطلع على ما يتعلمه الجميع.

source: You are eligible to upgrade in these courses:
ar: أنت مؤهل للترقية في هذه المقررات:

source: The name that will identify you in your courses. It cannot be changed later.
ar: الاسم الذي سيعرّفك في المقررات. لا يمكن تغييره لاحقا.

source: {assignment} is due for {course}.
ar: {assignment} مستحقة لـ {course}.

source: Sync {course} to your calendar
ar: مزامنة {course} إلى تقويمك

source: Sticking to a schedule is the best way to ensure that you successfully complete your self-paced course. This schedule for {course} will help you stay on track!
ar: إن الالتزام بجدول زمني هو أفضل طريقة لضمان إكمال الدورة التدريبية الخاصة بك بنجاح. سيساعدك هذا الجدول الزمني لـ {course} في البقاء على المسار الصحيح!

source: Once you sync your course schedule to your calendar, any updates to the course from your instructor will be automatically reflected. You can remove the course from your calendar at any time.
ar: بمجرد مزامنة جدول مساقك مع تقويمك، سيتم تلقائيًا عكس أي تحديثات للمقرر من معلمك. يمكنك إزالة المقرر من التقويم في أي وقت.

source: {course} dates have been updated on your calendar
ar: تم تحديث تواريخ {course} في التقويم

source: You have successfully shifted your course schedule and your calendar is up to date.
ar: لقد قمت بنقل جدول مساقك بنجاح والتقويم محدّث.

source: Access to the course you were looking for expired on {expiration_date}
ar: انتهت صلاحية الدخول إلى المقرر الذي كنت تبحث عنه في {expiration_date}

source: This learner does not have access to this course. Their access expired on {expiration_date}.
ar: هذا المتعلم ليس لديه حق الوصول إلى هذا المقرر، انتهت صلاحية دخوله في {expiration_date}.

source: {strong_open}Audit Access Expires {expiration_date}{strong_close}{line_break}You lose all access to this course, including your progress, on {expiration_date}.
ar: {strong_open} انتهاء صلاحية الدخول للتدقيق {expiration_date} {strong_close} {line_break} تفقد كل إمكانية الدخول إلى هذا المقرر، بما في ذلك التقدم الذي أحرزته، في {expiration_date}.

source: {line_break}Upgrade by {upgrade_deadline} to get unlimited access to the course as long as it exists on the site. {a_open}Upgrade now{sronly_span_open} to retain access past {expiration_date}{span_close}{a_close}
ar: {line_break} قم بالترقية بحلول {upgrade_deadline} للحصول على دخول غير محدود إلى المقرر طالما كانت موجودة على الموقع. {a_open} الترقية الآن {sronly_span_open} للاحتفاظ بحق الدخول بعد {expiration_date} {span_close} {a_close}

source: These define the context to disable lms-controlled discounts on. If no values are set, then the configuration applies globally. If a single value is set, then the configuration applies to all courses within that context. At most one value can be set at a time.<br>If multiple contexts apply to a course (for example, if configuration is specified for the course specifically, and for the org that the course is in, then the more specific context overrides the more general context.
ar: هذه تحدد السياق لتعطيل الخصومات التي يتحكم فيها lms. إذا لم يتم تعيين أي قيم، فسيتم تطبيق التشكيل بشكل عام. إذا تم تعيين قيمة واحدة، فسيتم تطبيق التشكيل على جميع الدورات في هذا السياق. يمكن تعيين قيمة واحدة على الأكثر في كل مرة. <br> إذا تم تطبيق سياقات متعددة على مقرر (على سبيل المثال، إذا تم تحديد التشكيل للمقرر على وجه التحديد، وللمؤسسة التي يوجد بها المقرر، فإن السياق الأكثر تحديدًا يتجاوز السياق الأكثر عمومية.

source: These define the context to configure the percentage for the first purchase discount.If multiple contexts apply to a course (for example, if configuration is specified for the course specifically, and for the org that the course is in, then the more specific context overrides the more general context.
ar: هذه تحدد السياق لتكوين النسبة المئوية لخصم الشراء الأول. إذا تم تطبيق سياقات متعددة على مقرر ما (على سبيل المثال، إذا تم تحديد التشكيل للمقرر على وجه التحديد، وللمؤسسة التي يوجد بها المقرر، فإن السياق الأكثر تحديدًا يتجاوز السياق العام.

source: You have access to the {bold_start}{enterprise_name}{bold_end} dashboard. To access the courses available to you through {enterprise_name}, {link_start}visit the {enterprise_name} dashboard{link_end}.
ar: يمكنك الوصول إلى لوحة تحكم {bold_start} {enterprise_name} {bold_end}. للوصول إلى الدورات التدريبية المتاحة لك من خلال {enterprise_name} ، {link_start} قم بزيارة {enterprise_name} لوحة التحكم {link_end}.

source: Enterprise Course Enrollments
ar: التحاق المجموعات في المقرر

source: Invalid grader reply. Please contact the course staff.
ar: إجابة مُقيّم غير صحيحة. يُرجى الاتصال بطاقم المقرر.

source: Enter the API key provided by MathWorks for accessing the MATLAB Hosted Service. This key is granted for exclusive use by this course for the specified duration. Please do not share the API key with other courses and notify MathWorks immediately if you believe the key is exposed or compromised. To obtain a key for your course, or to report an issue, please contact moocsupport@mathworks.com
ar: يُرجى إدخال مفتاح واجهة برمجة التطبيقات، الذي تقدّمه شركة ماثووركس، لاستخدام الخدمة المستضافة بلغة MATLAB. ويُمنح هذا المفتاح للاستخدام الحصري في هذا المقرر خلال مدّة محدّدة. يُرجى عدم استخدام مفتاح واجهة برمجة التطبيقات في مقررات أخرى، وإبلاغ ماثووركس فورًا إذا كنت تعتقد بأنّ المفتاح قد أصبح مكشوفًا. للحصول على مفتاح لمساقك، أو للإبلاغ عن مشكلة ما، يُرجى مراسلة الشركة على هذا العنوان moocsupport@mathworks.com.

source: If this error persists, please contact the course staff.
ar: إذا استمرّ ظهور هذا الخطأ، يُرجى الاتصال بطاقم المقرر.

source: Enter the passports for course LTI tools in the following format: "id:client_key:client_secret".
ar: يُرجى إدخال تصاريح أدوات LTI للمقرر بالصيغة التالية: "id:client_key:client_secret"

source: List of Textbook objects with (title, url) for textbooks used in this course
ar: قائمة بأجزاء (عناوين، وروابط) كل كتاب مستخدم في هذا المقرر

source: Slug that points to the wiki for this course
ar: العنوان المختصر الذي يشير إلى ويكي هذا المقرر

source: Cosmetic Course Display Price
ar: سعر اسم العرض المحسَّن الخاص بالمساق

source: The cost displayed to students for enrolling in the course. If a paid course registration price is set by an administrator in the database, that price will be displayed instead of this one.
ar: التكلفة التي تُعرَض للطلّاب للتسجيل في المقرر. إذا حدَّد أحد المشرِفين في قاعدة البيانات سعر التسجيل في المقرر المدفوع، فسيُعرض ذلك السعر بدلًا من هذا.

source: Course Advertised Start
ar: الإعلان عن بدء الدورة التعليمية

source: Enter the text that you want to use as the advertised starting time frame for the course, such as "Winter 2018". If you enter null for this value, the start date that you have set for this course is used.
ar: أدخل النص الذي تريد استخدامه كالإطار الزمني المعلن لبداية الدورة، مثل "شتاء 2018". إذا تركت هذه القيمة فارغة، سيتم استخدام تاريخ البدء الذي قمت بضبطه لهذه الدورة.

source: Pre-Requisite Courses
ar: مقررات أساسية

source: Pre-Requisite Course key if this course has a pre-requisite course
ar: مفتاح المقرر الأساسي إذا كان لهذا المقرر مقرر أساسي.

source: Enter true or false. When true, students can see the calculator in the course.
ar: يُرجى إدخال ’true‘ أو ’false‘. تشير القيمة ’true‘ إلى تمكين الطلّاب من رؤية عنصر الآلة الحاسبة ضمن المقرر.

source: Course Display Name
ar: اسم العرض الخاص بالمساق

source: Course Editor
ar: محرّر المقرر

source: Enter the method by which this course is edited ("XML" or "Studio").
ar: يُرجى إدخال طريقة تعديل هذا المقرر ("XML" أو "ستوديو").

source: Course Survey URL
ar: رابط استبيان المقرر

source: Enter the URL for the end-of-course survey. If your course does not have a survey, enter null.
ar: يُرجى إدخال الرابط الخاص باستبيان نهاية المقرر. في حال لم يستوجب مساقك الإدلاء باستبيان، يُرجى إدخال القيمة ’null‘.

source: Enter discussion categories in the following format: "CategoryName": {"id": "i4x-InstitutionName-CourseNumber-course-CourseRun"}. For example, one discussion category may be "Lydian Mode": {"id": "i4x-UniversityX-MUS101-course-2015_T1"}. The "id" value for each category must be unique. In "id" values, the only special characters that are supported are underscore, hyphen, and period. You can also specify a category as the default for new posts in the Discussion page by setting its "default" attribute to true. For example, "Lydian Mode": {"id": "i4x-UniversityX-MUS101-course-2015_T1", "default": true}.
ar: أدخل فئات المناقشة بالصيغة التالية: "CategoryName": {"id": "i4x-InstitutionName-CourseNumber-course-CourseRun"}. على سبيل المثال، قد تكون فئة مناقشة هي "Lydian Mode": {"id": "i4x-UniversityX-MUS101-course-2015_T1"}. يجب أن تكون قيمة "id" لكل فئة فريدة. في قيم "id"، الأحرف الخاصة الوحيدة التي يتم دعمها هي تسطير سفلي و مطّة ونقطة. يمكنك أيضا تحديد فئة منها كفئة افتراضية للمشاركات الجديدة في صفحة المناقشة عن طريق تعيين السمة "default" إلى صحيح. على سبيل المثال، "Lydian Mode": {"id": "i4x-UniversityX-MUS101-course-2015_T1", "default": true}.

source: Course Announcement Date
ar: تاريخ الإعلان عن المقرر

source: Enter the date to announce your course.
ar: يُرجى إدخال تاريخ الإعلان عن مساقك.

source: Enter policy keys and values to enable the cohort feature, define automated student assignment to groups, or identify any course-wide discussion topics as private to cohort members.
ar: يُرجى إدخال المفاتيح والقيَم لتفعيل ميزة الشعب، أو تعريف ميّزة الإسناد الآلي لواجبات الطلّاب إلى الشعب، أو تحديد مواضيع النقاش في مختلف أجزاء المقرر بأنّها خاصة بأعضاء شعبة معينة.

source: Course Is New
ar: المقرر جديد

source: Mobile Course Available
ar: المقرر مُتاح على الأجهزة المحمولة

source: Enter true or false. If true, the course will be available to mobile devices.
ar: يُرجى إدخال ’true‘ أو ’false‘ .تسمح القيمة ’true‘ بإتاحة استعراض المقرر على الأجهزة المحمولة.

source: Course Not Graded
ar: مقرر غير مٌقيّم

source: Enter true or false. If true, the course will not be graded.
ar: يُرجى إدخال ’true‘ أو ’false‘. ستعفي القيمة ’true‘ من تقييم المقرر.

source: For HTML textbooks that appear as separate tabs in the course, enter the name of the tab (usually the title of the book) as well as the URLs and titles of each chapter in the book.
ar: بالنسبة للكتب ذات صيغة HTML والتي تظهر بشكل علامات تبويب منفصلة في المقرر، يُرجى إدخال اسم علامة التبويب (يكون عادةً اسم الكتاب) بالإضافة إلى الروابط والعناوين الخاصة بكل فصل موجود بالكتاب.

source: Enter true or false. If true, students can create discussion posts that are anonymous to other students. This setting does not make posts anonymous to course staff.
ar: يُرجى إدخال ’true‘ أو ’false‘. سيسمح اختيارك للقيمة ’true‘ للطلّاب بإنشاء مشاركات في قسم ’النقاشات، تكون مجهولة المصدر بالنسبة للطلّاب الآخرين دون إخفاء هويّة الطالب الناشر عن طاقم المقرر.

source: Enter the names of the advanced modules to use in your course.
ar: أدخل أسماء الوحدات المتقدمة لاستخدامها في دورتك التدريبية.

source: True if timezones should be shown on dates in the course. Deprecated in favor of due_date_display_format.
ar: تكون القيمة صحيحة إذا توجّب إظهار المناطق الزمنية في تواريخ المقرر. تخفيض القيمة لصالح due_date_display_format.

source: Enter the external login method students can use for the course.
ar: يُرجى إدخال الطريقة الخارجية لتسجيل الدخول والتي يمكن للطلّاب استخدامها في المقرر.

source: Enter true or false. If true, students can download certificates before the course ends, if they've met certificate requirements.
ar: يُرجى إدخال ’true‘ أو ’false‘ .تسمح القيمة ’true‘ للطلّاب تنزيل الشهادات قبل انتهاء المقرر في حال استوفوا متطلّبات الشهادة.

source: Course About Page Image
ar: صورة صفحة "لمحة عن المقرر"

source: Edit the name of the course image file. You must upload this file on the Files & Uploads page. You can also set the course image on the Settings & Details page.
ar: تعديل اسم ملف صورة المقرر. يُرجى تحميل هذا الملف على صفحة "الملفات والتحميلات". كما ويمكنك أيضًا ضبط صورة المقرر على صفحة "الإعدادات والتفاصيل".

source: Course Banner Image
ar: صورة شعار الدورة التدريبية

source: Course Video Thumbnail Image
ar: صورة الفيديو المصغرة للدورة التدريبية

source: Issue Open Badges badges for this course. Badges are generated when certificates are created.
ar: إصدار الشارات المفتوحة لهذا المقرر. وتُولّد الشارات عند إعداد الشهادات.

source: Use this setting only when generating PDF certificates. Between quotation marks, enter the short name of the type of certificate that students receive when they complete the course. For instance, "Certificate".
ar: يُرجى استخدام هذا الإعداد فقط عند إنشاء شهادات بصيغة PDF. أدخل، بين علامتيّ اقتباس، الاسم المختصر لنوع الشهادة التي يتلقّاها الطلّاب عند إتمامهم للمقرر. مثل ’شهادة‘.

source: Use this setting only when generating PDF certificates. Between quotation marks, enter the long name of the type of certificate that students receive when they complete the course. For instance, "Certificate of Achievement".
ar: يُرجى استخدام هذا الإعداد فقط عند إنشاء شهادات بصيغة PDF. أدخل، بين علامتيّ اقتباس، الاسم الكامل لنوع الشهادة التي يتلقّاها الطلّاب عند إتمامهم للمقرر. مثل ’شهادة إنجاز‘.

source: If true, certificate Web/HTML views are enabled for the course.
ar: في حال ’true‘ـ يجري تفعيل خاصيّة استعراض شهادة هذا المقرر على شكل صفحة ويب أو بصيغة HTML.

source: Enter course-specific overrides for the Web/HTML template parameters here (JSON format)
ar: يُرجى إدخال التجاوزات الخاصة بالمساق بالنسبة للمعطيات النموذجية للويب/html هنا (بصيغة JSON)

source: Enter course-specific configuration information here (JSON format)
ar: يُرجى إدخال معلومات الإعدادات الخاصة بالمساق هنا (بصيغة JSON)

source: CSS Class for Course Reruns
ar: صف ’CSS‘ لعمليات إعادة طرح المقرر

source: Allows courses to share the same css class across runs even if they have different numbers.
ar: السماح للمقررات بتقاسم صف ’css‘ 1‘ ذاته خلال عمليات التشغيل حتى لو كانت تحمل أرقامًا مختلفة.

source: Course Organization Display String
ar: نص عرض تنظيم المقرر

source: Enter the course organization that you want to appear in the course. This setting overrides the organization that you entered when you created the course. To use the organization that you entered when you created the course, enter null.
ar: يُرجى إدخال رقم المؤسسة الذي تودّ أن يظهر في المقرر. يُلغي هذا الإعداد رقم المؤسسة الذي أُدخل عندما أُنشِئَ المقرر. لاستخدام الرقم المُدخل عند إنشاء المقرر، يُرجى إدخال القيمة ’null‘.

source: Course Number Display String
ar: نص عرض رقم المقرر

source: Enter the course number that you want to appear in the course. This setting overrides the course number that you entered when you created the course. To use the course number that you entered when you created the course, enter null.
ar: أدخل رقم المقرر الذي تودّ أن يظهر ضمن المقرر. يُلغي هذا الإعداد رقم المقرر الذي أُدخل عندما أُنشِئَ المقرر. لاستخدام الرقم المُدخل عند إنشاء المقرر، يُرجى إدخال القيمة ’null‘.

source: Course Maximum Student Enrollment
ar: العدد الأقصى للطلّاب الذين يمكنهم التسجيل في المقرر

source: Enter the maximum number of students that can enroll in the course. To allow an unlimited number of students, enter null.
ar: يُرجى إدخال العدد الأقصى للطلّاب الذين يمكنهم التسجيل في المقرر. يُرجى إدخال "null" للسماح لعدد غير محدّد من الطلّاب.

source: Whether to restrict enrollment to invitation by the course staff.
ar: سواء جُعل التسجيل محصورًا بامتلاك دعوة موجَّهة من طاقم المقرر

source: Pre-Course Survey Name
ar: اسم استبيان ما قبل المقرر

source: Name of SurveyForm to display as a pre-course survey to the user.
ar: اسم نموذج الاستبيان ’SurveyForm‘ الذي يجب عرضه للمستخدم كاستبيان ما قبل المقرر.

source: Pre-Course Survey Required
ar: مطلوب إجراء استبيان قبل المقرر

source: Specify whether students must complete a survey before they can view your course content. If you set this value to true, you must add a name for the survey to the Course Survey Name setting above.
ar: حدّد فيما إذا كان الطلاب مُلزمين بتعبئة استبيان قبل عرض محتويات مساقك. في حال ضبطت هذه القيمة على ’true‘، فسيتوجّب عليك إضافة اسم للاستبيان إلى إعداد "اسم استبيان المقرر" الموجودة أعلاه.

source: Course Visibility In Catalog
ar: إمكانية مشاهدة المقرر في القائمة

source: Defines the access permissions for showing the course in the course catalog. This can be set to one of three values: 'both' (show in catalog and allow access to about page), 'about' (only allow access to about page), 'none' (do not show in catalog and do not allow access to an about page).
ar: تحدِّد هذه القيمة صلاحيات الدخول لعرض المقرر ضمن دليل المساقات، يمكن ضبطها وفق أحد الخيارات الثلاث: ’كلاهما‘ (العرض في الدليل، والسماح بالدخول إلى صفحة ’لمحة عن المقرر‘)، ’لمحة عن المقرر‘ (السماح فقط بالدخول إلى صفحة ’لمحة عن المقرر‘)، ’لا شيء‘ (عدم السماح بالعرض ضمن القائمة، وحظر الدخول إلى صفحة ’لمحة عن المقرر‘).

source: Specify whether students must complete an entrance exam before they can view your course content. Note, you must enable Entrance Exams for this course setting to take effect.
ar: حدّد فيما إذا يجب على الطلّاب إتمام امتحان دخول قبل أن يتمكّنوا من استعراض محتوى مساقك. كما يُرجى ملاحظة أنّه عليك تفعيل ’امتحانات الدخول‘ ليُفعّل هذا الإعداد في مساقك.

source: Specify a minimum percentage score for an entrance exam before students can view your course content. Note, you must enable Entrance Exams for this course setting to take effect.
ar: يُرجى تحديد النسبة المئوية الدنيا لدرجة النجاح في امتحان الدخول قبل أن يتمكّن الطلّاب من استعراض محتوى مساقك. كما يُرجى ملاحظة أنّه عليك تفعيل ’امتحانات الدخول‘ ليُفعّل هذا الإعداد الخاص بالمساق.
