Repository: nelc/futurex-translations
Catalog: translation-overrides/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Must be greater than or equal to the course passing grade
ar: يجب أن تزيد عن درجة النجاح في المقرر أو تساويها

source: You can use the slider under Overall Grade Range to specify whether your course is pass/fail or graded by letter, and to establish the thresholds for each grade.
ar: يمكنك استخدام شريط التمرير المبيّن تحت ’نطاق الدرجات النهائية‘ لتحدّد نوع الدرجات التي تفضّل أن تتلقّاها؛ أي أن تُحتسَب إمّا بالأرقام أو بالأحرف، ولتحدّد أيضًَا الحدّ الأدنى لكلّ درجة.

source: You can specify whether your course offers students a grace period for late assignments.
ar: يمكنك تحديد ما إذا كان مساقك يقدّم للطلّاب فترة إمهال للواجبات المتأخرة أم لا.

source: Course Video Settings
ar: إعدادات فيديو المقرر

source: {email} has requested {studio_name} course creator privileges on edge
ar: أرسل {email} طلب الحصول على صلاحيات منشئ المقرر التي يتيحها استوديو {studio_name}

source: User '{user}' with e-mail {email} has requested {studio_name} course creator privileges on edge.
ar: تقدّم المستخدم '{user}'، صاحب البريد الإلكتروني {email}، بطلب الحصول على صلاحيات منشئ المقرر التي يتيحها استوديو {studio_name}

source: To grant or deny this request, use the course creator admin table.
ar: للموافقة على هذا الطلب أو رفضه، يُرجى استخدام جدول المشرفين على مُنشئي المساقات.

source: Your request for course creation rights to {studio_name} have been denied. If you believe this was in error, please contact {email}
ar: عذرًا، رُفِض طلبك الذي تقدّمت به إلى {studio_name} للحصول على حقوق إنشاء مقرر. إذا كنت تعتقد بأنّ هناك خطأ ما، يُرجى مراسلتنا على {email}

source: Your request for course creation rights to {studio_name} have been granted. To create your first course, visit {url}
ar: تهانينا، لقد قُبِل طلبك الذي تقدّمت به إلى {studio_name} للحصول على حقوق إنشاء مقرر. لتنشئ مشاقك الأوّل، يُرجى زيارة {url}

source: Your course creation rights to {studio_name} have been revoked. If you believe this was in error, please contact {email}
ar: عذرًا، أُلغِي طلبك الذي تقدّمت به إلى {studio_name} للحصول على حقوق إنشاء مقرر. إذا كنت تعتقد بأنّ هناك خطأ ما، يُرجى مراسلتنا على {email}

source: Your course creator status for {studio_name}
ar: حالة منشئ مساقك في {studio_name}

source: Required data to force publish course.
ar: البيانات المطلوبة لتنفيذ النشر للدورة التدريبية.

source: Visit your {link_start}dashboard{link_end} to see your courses.
ar: تفضّل بزيارة {link_start}لوحة المعلومات{link_end} الخاصة بحسابك لرؤية مساقاتك.

source: This course uses a legacy storage format.
ar: تستخدم هذه الدورة تنسيق تخزين قديم.

source: Current Course:
ar: المقرر الحالي:

source: Course Navigation
ar: تصفّح المقرر
