Repository: nelc/futurex-translations
Catalog: translation-overrides/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Community TAs are members of the community who help course teams moderate discussions. They can see posts by learners in their assigned cohort or enrollment track, and can edit or delete posts, clear flags, close or re-open threads, and endorse responses. Their posts are marked as 'Community TA'. Only enrolled learners can be added as Community TAs.
ar: المساعدون الفنيون في المجتمع هم أعضاء في المجتمع يساعدون فرق المساقات التدريبية على إدارة المناقشات. يمكنهم مشاهدة مشاركات المتعلمين في المجموعة النموذجية أو مسار التسجيل المخصص لهم ، ويمكنهم تحرير أو حذف المشاركات ، ومسح العلامات ، وإغلاق أو إعادة فتح سلاسل الرسائل ، وتأييد الردود. تم وضع علامة على مشاركاتهم على أنها "مساعد تقنية في المنتديات". يمكن إضافة المتعلمين المسجلين فقط كمساعدين تقنية للمجتمع.

source: CCX Coaches are able to create their own Custom Courses based on this course, which they can use to provide personalized instruction to their own students based in this course material.
ar: يستطيع مدربو CCX إنشاء مقرر مخصص خاص بهم بناءًا على هذا المقرر والذي يمكنهم استخدامه لتزويد تعليمات مخصصة لطلابهم بناءًا على ما يرد في مواد هذا المقرر.

source: To see the status for all email tasks submitted for this course, click this button:
ar: لرؤية حالة رسائل البريد التي أُرسلت لهذه الدورة التدريبية، قم بالضغط على هذا الزر:

source: Set Course Mode Price
ar: تحديد سعر وضعية المقرر

source: Please enter Course Mode detail below
ar: يرجى إدخال تفاصيل وضعية المقرر أدناه

source: Course Price
ar: سعر المقرر

source: Note: This feature is available only to courses with a small number of enrolled learners.
ar: ملاحظة: هذه الميزة متاحة فقط في الدورات التي يكون عدد الطلاب المسجلّين فيها قليل.

source: Location of problem in course
ar: موقع المسألة في المقرر

source: Click to display the grading configuration for the course. The grading configuration is the breakdown of graded subsections of the course (such as exams and problem sets), and can be changed on the 'Grading' page (under 'Settings') in Studio.
ar: أنقر هنا لعرض طريقة توزيع الدرجات لهذا المقرر. وهي عبارة عن تفصيل الدرجات للأقسام الفرعية للمقرر التي تم تقييمها (مثل الامتحانات ومجموعات المسائل)، ويمكن تغيير ذلك على صفحة ’التقييم‘ (تحت بند ’الإعدادات‘) في Studio.

source: For large courses, generating some reports can take several hours. When report generation is complete, a link that includes the date and time of generation appears in the table below. These reports are generated in the background, meaning it is OK to navigate away from this page while your report is generating.
ar: يمكن أن يستغرق إنشاء التقارير للمقررات الكبيرة بضع ساعات، وعندما ينتهي إنشاء التقرير سوف يظهر في أسفل الجدول رابط يتضمن تاريخ ووقت إنشاء التقرير. ويتم إنشاء هذه التقارير في الخلفية أي أنه يمكنك أن تتصفح الموقع خارج هذه الصفحة بينما يتم إنشاء التقرير.

source: For smaller courses, click to list profile information for enrolled students directly on this page:
ar: في المقررات الصغيرة أنقر لإنشاء قائمة بمعلومات الملف الشخصي للمتعلمين الملتحقين مباشرة على هذه الصفحة

source: Click to generate a CSV file of all students enrolled in this course, along with profile information such as email address and username:
ar: أنقر لإنشاء ملف بصيغة CSV بكافة المتعلمين الملتحقين بهذا المقرر، إلى جانب معلومات الملف الشخصي مثل عنوان البريد الإلكتروني واسم المستخدم.

source: Click to generate a CSV file that lists learners who can enroll in the course but have not yet done so.
ar: أنقر لإنشاء ملف CSV يحتوي على أسماء المتعلمين الذين يمكنهم التسجيل في المقرر ولكنهم لم يقوموا بالتسجيل بعد.

source: Click to generate a CSV file of all proctored exam results in this course.
ar: أنقر لإنشاء ملف CSV بجميع نتائج الامتحانات المراقبة لهذا المقرر.

source: Click to generate a CSV file of survey results for this course.
ar: أنقر لإنشاء ملف بصيغة CSV لنتائج استبيان هذا المقرر.

source: My Courses
ar: مساقاتي

source: Explore Courses
ar: استكشف المقررات

source: {p_tag}You currently do not have any peer grading to do. In order to have peer grading to do: {ul_tag} {li_tag}You need to have submitted a response to a peer grading problem.{end_li_tag} {li_tag}The course team needs to score the essays that are used to help you better understand the grading criteria.{end_li_tag} {li_tag}There must be submissions that are waiting for grading.{end_li_tag} {end_ul_tag} {end_p_tag}
ar: {p_tag}ليس لديك حاليًا أية مهمّات تقييم الزملاء تنتظرك. وحتى تصلك مهمّات تقييم نظراء: {ul_tag} {li_tag}يجب أن تكون قد قدّمت ردًا على إحدى مسائل تقييم النظراء{end_li_tag} {li_tag}يتعيّن أن يقوم فريق المقرر بتقييم المقالات المستخدمة بغرض مساعدتك على فهم معايير التقييم بشكلٍ أفضل.{end_li_tag} {li_tag}يتعيّن وجود تسليمات تنتظر التقييم.{end_li_tag} {end_ul_tag} {end_p_tag}

source: Here is a list of problems that need to be peer graded for this course.
ar: فيما يلي قائمة بالمسائل التي يجب أن يصححها الزملاء في هذا المقرر

source: Our system indicates that you are trying to access this {platform_name} course from a country or region currently subject to U.S. economic and trade sanctions. Unfortunately, because {platform_name} is required to comply with export controls, we cannot allow you to access this course at this time.
ar: يشير نظامنا إلى أنك تحاول الوصول إلى مقرر {platform_name} هذه من بلد أو منطقة تخضع حاليًا لعقوبات اقتصادية وتجارية أمريكية. لسوء الحظ ، نظرًا لأن {platform_name} مطلوب للامتثال لضوابط التصدير ، لا يمكننا السماح لك بالوصول إلى هذا المقرر في الوقت الحالي.

source: Course Duration Limits
ar: حدود مدة الدورة

source: Pre-Course Survey
ar: استبيان ما قبل المقرر

source: You can begin your course as soon as you complete the following form. Required fields are marked with an asterisk (*). This information is for the use of {platform_name} only. It will not be linked to your public profile in any way.
ar: يمكنك البدء بمساقك ما أن تملأ الاستمارة التالية. الحقول الضرورية محددة بعلامة النجم (*). هذه المعلومات يستخدمها {platform_name} حصرًا ولن يتم ربطها بملفك الشخصي العلني بأي شكل كان.

source: We use the information you provide to improve our course for both current and future students. The more we know about your specific needs, the better we can make your course experience.
ar: نستخدم المعلومات التي تزوّدنا بها لنحسّن مساقنا للطلّاب الحاليين والمستقبليين. فكلّما عرفنا أكثر عن احتياجاتك، تمكّنّا من زيادة تحسين تجربتك مع المقرر.

source: If you have any questions about this course or this form, you can contact {link_start}{mail_to_link}{link_end}.
ar: إذا كان لديك أي أسئلة حول هذه الدورة أو الاستمارة، يمكنك الاتصال على {link_start}{mail_to_link}{link_end}.

source: Search the course
ar: إبحث عن المقرر

source: Start Course
ar: إبدأ المقرر

source: The deadline to upgrade to a verified certificate for this course has passed.
ar: لقد انقضى موعد التحقّق النهائي المحدّد لهذا المقرر.

source: Course Wiki
ar: ويكي المقرر

source: Proven motivator to complete the course
ar: حافز مؤكد لاستكمال المقرر

source: Certificate purchases help {platform_name} continue to offer free courses
ar: تساعد عمليات شراء الشهادات {platform_name} على الاستمرار في تقديم مقررات مجانية

source: Study hard and pass the course
ar: ادرس بجد واجتاز المقرر

source: This course does not have any updates.
ar: لا يوجد تحديثات بالمساق

source: Explore New Courses
ar: استكشف المقررات الجديدة

source: You will receive an activation email. You must click on the activation link to complete the process. Don't see the email? Check your spam folder and mark emails from class.stanford.edu as 'not spam', since you'll want to be able to receive email from your courses.
ar: ستصلك رسالة تفعيل عبر البريد الإلكتروني، ثمّ يجب الضغط على رابط التفعيل لاستكمال عملية التسجيل. وإذا لم تجد هذه الرسالة، يُرجى التحقّق من صندوق السبام، أي الرسائل غير المرغوبة، وتحديد الرسائل الواردة من class.stanford.edu على أنّها ’ليست رسائل غير مرغوبة‘ لتتمكّن بعدئذٍ من استلام الرسائل من مساقاتك.

source: Once registered, most questions can be answered in the course specific discussion forums or through the FAQs.
ar: لدى الانتهاء من التسجيل، يمكن الإجابة على معظم الأسئلة في منتديات النقاشات الخاصة بالمساق أو من خلال صفحة الأسئلة الشائعة.

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the about section of the {platform_name} Courses web site.
ar: إذا لم تكن قد تقدّمت بهذا الطّلب، فلا تحتاج إلى فعل أي شيء؛ ولن تتلقى منّا أي رسائل أخرى. يُرجى عدم الرد على هذه الرسالة؛ وإذا احتجت إلى المساعدة، يمكنك مراجعة قسم اللمحة في موقع مقررات {platform_name}.

source: We are sorry. Our course staff did not approve your request to change your name from {old_name} to {new_name}. If you need further assistance, please e-mail the tech support at {email}
ar: نعتذر. لم يوافق طاقم المقرر لدينا على طلبك تغيير اسمك من {old_name} إلى {new_name}. إذا كنت بحاجة للمزيد من المساعدة، الرجاء مراسلة فريق الدعم الفني على البريد الإلكتروني {email}

source: Course Certificates
ar: شهادات المقرر

source: This course does not use a mode that offers certificates.
ar: لا يستخدم هذا المقرر وضعًا يسمح بتقديم شهادات.

source: Specify a course title to use on the certificate if the course's official title is too long to be displayed well.
ar: حدِّد عنواناً للمقرر لاستخدامه في الشهادة إذا كان عنوان المقرر طويل جداً ليتم عرضه بشكل جيد.

source: To view a sample certificate, choose a course mode and select {em_start}Preview Certificate{em_end}.
ar: لعرض شهادة نموذجيّة، يُرجى اختيار وضع للمقرر وتحديد {em_start} معاينة الشهادة{em_end}

source: To begin issuing course certificates, a course team member with either the Staff or Admin role selects {em_start}Activate{em_end}. Only course team members with these roles can edit or delete an activated certificate.
ar: للبدء في إصدار شهادات لهذه الدورة التعليمية يقوم أحد أعضاء الفريق الذي يقوم بدور عضو طاقم أو مشرف {em_start}Activate{em_end}. يمكن فقط لأعضاء فريق الدورة التعليمية الذي يشغلون هذه الأدوار تحرير أو حذف شهادة التي تم تفعيلها.

source: {em_start}Do not{em_end} delete certificates after a course has started; learners who have already earned certificates will no longer be able to access them.
ar: {em_start} لا {em_end} تحذف الشهادات بعد ابتداء المقرر؛ إذ لن يتمكّن المتعلّمون ممن نالوا شهاداتٍ في وقتٍ سابق من الوصول إلى إليها بعد ذلك.

source: Course Team
ar: فريق المقرر

source: To create a link to this unit from an HTML component in this course, enter "/jump_to_id/<location ID>" as the URL value.
ar: لإنشاء رابط إلى هذه الوحدة من عنصر HTML في هذا المقرر، أدخل "/jump_to_id/<location ID>" كقيمة الرابط.

source: Create a Course Rerun of:
ar: إنشاء ’تشغيل ثانٍ للمقرر‘ لـ:

source: Create a re-run of a course
ar: إنشاء تشغيل ثانٍ لأحد المساقات

source: Provide identifying information for this re-run of the course. The original course is not affected in any way by a re-run.
ar: يُرجى تزويد معلومات تعريفية لهذا التشغيل الثاني للمقرر. ومن الجدير بالملاحظة أنّ المقرر الأساسي لا يتأثّر بالتشغيل الثاني بأي شكل من الأشكال.

source: Note: Together, the organization, course number, and course run must uniquely identify this new course instance.
ar: ملاحظة: المنظمة و رقم المقرر و تشغيل المقرر يجب أن تعرِّف سويا هذا المقرر بشكل فريد.

source: Required Information to Create a re-run of a course
ar: المعلومات المطلوبة لإنشاء تشغيل ثانٍ لمساق ما

source: The public display name for the new course. (This name is often the same as the original course name.)
ar: اسم العرض العمومي للمقرر الجديد. (غالبًا ما يكون هذا الاسم هو نفسه اسم المقرر الأساسي.)

source: The name of the organization sponsoring the new course. (This name is often the same as the original organization name.)
ar: اسم المنظمة الراعية للمقرر الجديد. (غالبًا ما يكون هذا الاسم هو نفسه اسم المنظمة الأصلي.)

source: The unique number that identifies the new course within the organization. (This number will be the same as the original course number and cannot be changed.)
ar: الرقم المميز للمقرر الجديد داخل المؤسسة. (هذا الرقم هو نفس رقم المقرر الأصلي ولا يمكن تغييره).

source: The term in which the new course will run. (This value is often different than the original course run value.)
ar: الفترة التي سيجري فيها تشغيل المقرر الجديد. (غالبًا ما تكون هذه القيمة مختلفة عن قيمة تشغيل المقرر الأساسي).

source: When will my course re-run start?
ar: متى سيبدأ التشغيل الثاني لمساقي؟

source: The new course is set to start on January 1, 2030 at midnight (UTC).
ar: من المقرّر أن يبدأ المقرر الجديد في 1 يناير 2030 عند منتصف الليل (UTC).

source: What transfers from the original course?
ar: ما الذي ينتقل من المقرر الأساسي؟

source: The new course has the same course outline and content as the original course. All problems, videos, announcements, and other files are duplicated to the new course.
ar: يحتوى المقرر الجديد على المخطّط الكلّي والمحتوى نفسهما الذين يحتوي عليهما المقرر الأساسي. ويجري نسخ جميع المسائل، والفيديوهات، والإعلانات، والملفّات الأخرى إلى المقرر الجديد.

source: What does not transfer from the original course?
ar: ما الذي لا ينتقل من المقرر الأساسي؟

source: You are the only member of the new course's staff. No students are enrolled in the course, and there is no student data. There is no content in the discussion topics or wiki.
ar: أنت هو العضو الوحيد في طاقم المقرر الجديد. لا يوجد طلبة مسجّلون في هذا المقرر، ولا توجد أي بيانات للطلبة. كما لا يوجد أي محتوى في مواضيع المناقشة ولا في الويكي.

source: Learn more about Course Re-runs
ar: تعلّم المزيد عن التشغيلات الثانية للمقرر

source: Course Updates
ar: تحديثات المقرر

source: Use course updates to notify students of important dates or exams, highlight particular discussions in the forums, announce schedule changes, and respond to student questions. You add or edit updates in HTML.
ar: استخدم تحديثات المقرر لإعلام الطلّاب بالتواريخ أو الامتحانات المهمّة، وتسليط الضوء على مناقشات معيّنة في المنتديات، والإعلان عن التغييرات المُدخلة على الجدول، والردّ على أسئلة الطلّاب. ويمكنك إضافة تحديثات أو تعديلها بلغة HTML.

source: This course was created as a re-run. Some manual configuration is needed.
ar: أُنشِئ هذا المقرر كتشغيل ثانٍ، ويتطلّب بالتالي ضبط بعض الإعدادات اليدوية.

source: No course content is currently visible, and no learners are enrolled. Be sure to review and reset all dates, including the Course Start Date; set up the course team; review course updates and other assets for dated material; and seed the discussions and wiki.
ar: لا يوجد محتوى للدورة التدريبية مرئيًا في الوقت الراهن، ولا يوجد متعلمون مسجلين. تأكد من مراجعة وإعادة تعيين كافة التواريخ، بما في ذلك تاريخ بدء الدورة التدريبية؛ إعداد فريق الدورة التدريبية؛ مراجعة تحديثات الدورة التدريبية وغيرها من الأصول للمواد المؤرخة؛ وتنظيم المناقشات والويكي.

source: This course uses features that are no longer supported.
ar: يستخدم هذا المقرر مزايا لم تعد مدعومة.

source: To avoid errors, {platform_name} strongly recommends that you remove unsupported features from the course advanced settings. To do this, go to the {link_start}Advanced Settings page{link_end}, locate the "Advanced Module List" setting, and then delete the following modules from the list.
ar: لتجنّب الأخطاء، توصيك {platform_name} بشدّة بأن تُزيل المزايا غير المدعومة من إعدادات المقرر المتقدِّمة. ولتفعل هذا، يُرجى الذهاب إلى {link_start}صفحة الإعدادات المتقدِّمة{link_end}، وتحديد إعداد "قائمة الوحدات المتقدِّمة"، ثمّ حذف الوحدات التالية من القائمة.

source: This course has proctored exam settings that are incomplete or invalid.
ar: إعدادات الاختبار المراقب لهذا المقرر غير مكتملة أو غير صحيحة.

source: Reindex current course
ar: إعادة فهرسة المقرر الحالي

source: Creating your course organization
ar: جارٍ إنشاء منطمة مساقك

source: Create a section, then add subsections and units. Open a unit to add course components.
ar: أَنشِئ قسمًا، ثمّ أضف أقسامًا فرعية ووحدات. وافتح وحدة لإضافة مكوِّنات المقرر.

source: Reorganizing your course
ar: إعادة تنظيم مساقك

source: Learn more about the course outline
ar: تعلّم المزيد عن المخطّط الكلّي للمقرر

source: Note: Pages are publicly visible. If users know the URL of a page, they can view the page even if they are not registered for or logged in to your course.
ar: ملاحظة: الصفحات مرئية للجميع. فإذا كان المستخدمون يعرفون رابط إحدى الصفحات، يمكنهم رؤية الصفحة حتّى لو لم يكونوا مسجّلين في مساقك أو لم يسجّلوا دخولهم فيه.

source: You can add additional custom pages to your course.
ar: يمكنك إضافة المزيد من الصفحات المخصّصة إلى مساقك.

source: Preview of Pages in your course
ar: معاينة الصفحات في مساقك

source: Course Export
ar: تصدير المقرر

source: About Exporting Courses
ar: حول تصدير المقررات

source: You can export courses and edit them outside of {studio_name}. The exported file is a .tar.gz file (that is, a .tar file compressed with GNU Zip) that contains the course structure and content. You can also re-import courses that you've exported.
ar: يمكنك تصدير المقررات وتعديلها خارج استوديو {studio_name}. ويحمل الملفّ المصدَّر امتداد .tar.gz (أي ملف .tar مضغوط ببرنامج GNU Zip) ويحتوي على هيكل المقرر ومحتواه. كما يمكنك إعادة استيراد المقررات التي صدّرتها.

source: {em_start}Caution:{em_end} When you export a course, information such as MATLAB API keys, LTI passports, annotation secret token strings, and annotation storage URLs are included in the exported data. If you share your exported files, you may also be sharing sensitive or license-specific information.
ar: {em_start}تحذير:{em_end} عندما تُصدِّر مقررًا، فإنّ بعض المعلومات، مثل مفاتيح MATLAB API، وتصاريح توافقية أدوات التعلّم، ونصوص الرموز السرّية للملاحظات التوضيحية، وروابط تخزين الملاحظات التوضيحية، تكون مشمولة ضمن البيانات المصدَّرة. وإذا شاركت ملفاتك المصدَّرة مع الآخرين، فقد تشاركهم ضمنها بعض المعلومات الحسّاسة أو الخاصة بالترخيص.

source: Export My Course Content
ar: تصدير محتوى مساقي

source: Export Course Content
ar: تصدير محتوى المقرر

source: Course Export Status
ar: حالة تصدير المقرر

source: Your exported course can now be downloaded
ar: يمكن الآن تنزيل المقرر الذي تم تصديره

source: Download Exported Course
ar: تنزيل المقرر المصدّر

source: Data {em_start}exported with{em_end} your course:
ar: البيانات {em_start}المصدَّرة مع{em_end} مساقك:

source: Course Content (all Sections, Sub-sections, and Units)
ar: محتوى المقرر (جميع الأقسام، والأقسام الفرعية، والوحدات)

source: Course Structure
ar: هيكل المقرر

source: Course Assets
ar: المواد الملحقة بالمساق

source: Course Settings
ar: الإعدادات الخاصة بالمساق

source: Data {em_start}not exported{em_end} with your course:
ar: البيانات {em_start}غير المصدَّرة{em_end} مع مساقك:

source: Course Team Data
ar: بيانات فريق المقرر

source: Why export a course?
ar: ما هو الهدف من تصدير مقرر ما؟

source: You may want to edit the XML in your course directly, outside of {studio_name}. You may want to create a backup copy of your course. Or, you may want to create a copy of your course that you can later import into another course instance and customize.
ar: قد ترغب في تعديل لغة XML في مساقك مباشرةً، خارج استوديو {studio_name}. قد ترغب أيضًا في إنشاء نسخة احتياطية من مساقك. أو قد ترغب في إنشاء نسخة من مساقك بحيث يمكنك توريدها لاحقًا إلى مقرر فرعي آخر وتعديلها بحسب الحاجة.

source: Course content and structure
ar: محتوى المقرر وهيكلته

source: Course dates
ar: تواريخ المقرر

source: The course team
ar: فريق المقرر

source: Use an archive program to extract the data from the .tar.gz file. Extracted data includes the course.xml file, as well as subfolders that contain course content.
ar: استخدم برنامج أرشفة لاستخراج البيانات من الملفّ الذي يحمل امتداد .tar.gz. وتشمل البيانات المستخرجة ملف course.xml، بالإضافة إلى الملفّات الفرعية التي تتضمّن محتوى المقرر.

source: Learn more about exporting a course
ar: تعلّم المزيد عن تصدير المساقات

source: Export Course to Git
ar: تصدير المقرر إلى Git

source: Use this to export your course to its git repository.
ar: استخدام هذا لتصدّر مساقك إلى مستودع git الخاص به.

source: This will then trigger an automatic update of the main LMS site and update the contents of your course visible there to students if automatic git imports are configured.
ar: سيحفّز هذا بعدئذٍ تحديثًا تلقائيًّا للموقع الرئيسي لنظام إدارة التعلّم، وسيحدّث محتويات مساقك المرئي هناك للطلّاب إذا كانت إعدادات عمليات الاستيراد التلقائية لـ git مضبوطة.

source: Export Course to Git:
ar: تصدير المقرر إلى Git:

source: giturl must be defined in your course settings before you can export to git.
ar: يجب تحديد الرابط لبرنامج git في الإعدادات الخاصة بمساقك حتى تتمكّن من التصدير إلى هذا البرنامج.

source: Your course:
ar: مساقك:

source: Course git url:
ar: الرابط لبرنامج git الخاص بالمساق:

source: Enrollment track groups allow you to offer different course content to learners in each enrollment track. Learners enrolled in each enrollment track in your course are automatically included in the corresponding enrollment track group.
ar: تسمح لك مجموعات مسارات التسجيل بعرض محتوى مقرر مختلف للمتعلمين في كل مسار، ويتم إدراج المتعلمين الملتحقين في كل مسار تسجيل في مساقك تلقائيًا في مجموعة مسار التسجيل المناسبة.

source: On unit pages in the course outline, you can restrict access to components to learners based on their enrollment track.
ar: يمكنك تقييد وصول المتعلمين إلى عناصر من مخطط المقرر باعتبار مسار التسجيل.

source: You cannot edit enrollment track groups, but you can expand each group to view details of the course content that is designated for learners in the group.
ar: لا يمكنك تعديل مجموعات مسار التسجيل، ولكن يمكنك توسيع كل مجموعة لعرض تفاصيل محتوى المقرر المخصص للمتعلمين في تلك المجموعة.

source: If you have cohorts enabled in your course, you can use content groups to create cohort-specific courseware. In other words, you can customize the content that particular cohorts see in your course.
ar: إذا كانت الشعب مفعَّلة في مساقك، يمكنك استخدام مجموعات المحتوى لإنشاء محتويات في المقرر مخصَّصة للشعب. وبتعبير آخر، يمكنك تخصيص المحتوى الذي تراه شعب معيَّنة في مساقك.

source: Each content group that you create can be associated with one or more cohorts. In addition to making course content available to all learners, you can restrict access to some content to learners in specific content groups. Only learners in the cohorts that are associated with the specified content groups see the additional content.
ar: يمكن ربط كل مجموعة محتوى تنشئها في شعبة أو أكثر. بالإضافة إلى توفير محتوى المقرر لجميع المتعلمين، كما يمكنك تقييد الوصول إلى بعض المحتوى للمتعلمين في مجموعات محتوى محددة. حيث لا يشاهد المحتوى الإضافي سوى المتعلمين في الشعبة المرتبطة بمجموعات المحتوى المحددة.

source: Use experiment group configurations if you are conducting content experiments, also known as A/B testing, in your course. Experiment group configurations define how many groups of learners are in a content experiment. When you create a content experiment for a course, you select the group configuration to use.
ar: يُرجى استخدام إعدادات مجموعة التجربة إذا كنت تقوم ببعض التجارب حول المحتوى، المعروفة كذلك بـ "اختبار A/B". وتحدِّد إعدادات مجموعة التجربة عدد مجموعات المتعلمين الموجودين في إحدى تجارب المحتويات. وعند إنشاء تجربة محتوى معيّنة لمساق ما يُرجى تحديد عدد المجموعة الذي يجب استخدامه.

source: {studio_name} helps manage your online courses, so you can focus on teaching them
ar: يساعد {studio_name} على معالجة مساقاتك المتاحة عبر الإنترنت، حتى تركّز بدورك على تعليمها للغير.

source: {studio_name} Helps You Keep Your Courses Organized
ar: يساعدك {studio_name} على إبقاء مساقاتك منظّمة

source: Keeping Your Course Organized
ar: إبقاء مساقك منظّمًا

source: The backbone of your course is how it is organized. {studio_name} offers an {strong_start}Outline{strong_end} editor, providing a simple hierarchy and easy drag and drop to help you and your students stay organized.
ar: العمود الفقري لدورتك التدريبية يتمثل في كيفية تنظيمها. {studio_name} يقدم محرر {strong_start}Outline{strong_end}، مما يوفر تسلسلاً هرميًا بسيطًا وسهل السحب والإسقاط لمساعدتك وطلابك على البقاء في حالة منظمة.
